[
    {
        "Names of Judges":"The Hon. William Johnstone Ritchie",
        "Date of Appointment":"1875-09-30",
        "Date of Departure":"1879-01-11  Footnote 1",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=william-johnstone-ritchie",
        "bio":"William Johnstone Ritchie was born in Annapolis, Nova Scotia, on October 28, 1813. He was the son of Thomas Ritchie and Elizabeth Wildman Johnstone. After graduating from the Pictou Academy, he studied law in Halifax in the office of his brother, John William Ritchie. He was called to the bar of Nova Scotia in 1837 but moved to Saint John, New Brunswick, and was called to the bar of that province the following year. In 1846 he was elected to the Legislative Assembly of New Brunswick. In keeping with his pledge to resign if a fellow Liberal candidate failed to win a by-election, he gave up his seat in 1851, only to be re-elected three years later. In 1855 he left politics to accept an appointment to the Supreme Court of New Brunswick, and 10 years later he was named Chief Justice of New Brunswick. He was appointed to the newly established Supreme Court of Canada on September 30, 1875 and became its chief justice on January 11, 1879. He served on the Supreme Court for 17 years. Chief Justice Ritchie died on September 25, 1892, at the age of 78."
    },
    {
        "Names of Judges":"The Hon. Samuel Henry Strong",
        "Date of Appointment":"1875-09-30",
        "Date of Departure":"1892-12-13  Footnote 1",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=samuel-henry-strong",
        "bio":"Samuel Henry Strong was born in Poole, England, on August 13, 1825. He was the son of Samuel Spratt Strong and Jane Elizabeth Gosse. \r\n    His family emigrated to Canada in 1836 and settled in Bytown, Upper Canada (Ottawa, Ontario). While enrolled as a student with the\r\n    Law Society of Upper Canada, he articled with Augustus Keefer of Bytown, then with Henry Eccles of Toronto. Called to the bar in 1849, \r\n    he established his practice in Toronto, where he later founded the firm of Strong & Matheson. In 1869, as a legal adviser to Prime \r\n    Minister John A. Macdonald, he worked on a legislative proposal for the creation of a national supreme court. That year, he was \r\n    appointed Vice-chancellor of the Court of Chancery of Ontario, and in 1874 he was elevated to the Ontario Court of Error & Appeal. \r\n    He was appointed to the newly established Supreme Court of Canada on September 30, 1875 and named Chief Justice of Canada on \r\n    December 13, 1892. He served on the Supreme Court for 27 years before retiring on November 18, 1902. Chief Justice Strong died on \r\n    August 31, 1909, at the age of 84."
    },
    {
        "Names of Judges":"The Hon. Jean-Thomas Taschereau",
        "Date of Appointment":"1875-09-30",
        "Date of Departure":"1878-10-06",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=jean-thomas-taschereau",
        "bio":"Jean-Thomas Taschereau was born in Quebec City, Lower Canada (Quebec),\r\n          on December 12, 1814. He was the son of Jean-Thomas\r\n          Taschereau and Marie Panet . After graduating from the Petit\r\n          Séminaire de Québec ,\r\n          he began articling in 1832 with his cousin Joseph-André Taschereau and then with admiralty specialist Henry Black. Called to the bar in\r\n          1836, he went to Paris to study law at the Faculté de droit .\r\n          Upon his return in 1837, he settled in Quebec City, where he practised\r\n          law for 18 years. From 1855 to 1857, he taught commercial law on a\r\n          part-time basis at Laval University. In 1865 he was appointed a judge\r\n          of the Superior Court of Quebec, having served as an assistant judge\r\n          since 1855. Eight years later, he was elevated to the Court of Queen's\r\n          Bench of Quebec, and on September 30, 1875, he was appointed to the\r\n          Supreme Court of Canada. He served on the Supreme Court for three years\r\n          before his retirement on October 7, 1878. Justice Taschereau died on\r\n          November 9, 1893, at the age of 78."
    },
    {
        "Names of Judges":"The Hon. Télesphore Fournier",
        "Date of Appointment":"1875-09-30",
        "Date of Departure":"1895-09-11",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=telesphore-fournier",
        "bio":"Télesphore Fournier was born in Saint-François-de-la-Rivière-du-Sud ,\r\n  Lower Canada (Quebec), on August 5, 1823. He was the son of Guillaume\r\n  Fournier and Marie-Archange Morin . After graduating from the Séminaire de Nicolet ,\r\n  he began his legal training in 1842 in the office of René-Édouard\r\n  Caron . Called to the bar in 1846, he established his practice in Quebec City\r\n  and later became president of the provincial bar. His interest in politics\r\n  led him to launch a newspaper, Le National , in 1855, and to run for political\r\n  office. He was a member of Parliament from 1870 to 1875 and a member of the\r\n  Legislative Assembly of Quebec from 1871 to 1873 (at the time, it was possible\r\n  to hold more than one office). At the federal level, he served as Minister\r\n  of Inland Revenue, Minister of Justice and Postmaster General. On April 8,\r\n  1875, when he was Minister of Justice, the bill creating the Supreme Court\r\n  of Canada was adopted. He was appointed to the Court on September 30, 1875\r\n  and served on it for 20 years before his retirement on September 12, 1895.\r\n  Justice Fournier died on May 10, 1896, at the age of 72."
    },
    {
        "Names of Judges":"The Hon. William Alexander Henry",
        "Date of Appointment":"1875-09-30",
        "Date of Departure":"1888-05-03",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=william-alexander-henry",
        "bio":"William Alexander Henry was born in Halifax, Nova Scotia, on December 30,\r\n  1816. He was the son of Robert Nesbit Henry and Margaret Hendricken. Soon after\r\n  his birth, his family moved to Antigonish, Nova Scotia, where he was educated\r\n  by Thomas Trotter. He studied law in the office of Alexander McDougall in Antigonish\r\n  and was called to the bar in 1841. The previous year, he had been elected to\r\n  the Legislative Assembly of Nova Scotia. He was defeated in the 1843 elections\r\n  but was re-elected in 1847. Five years later, he entered the Cabinet, and in\r\n  1854 was named Solicitor General. He changed political affiliation in 1857\r\n  and was named Solicitor General again, under a different administration, in\r\n  1859. Appointed Attorney General in 1864, he was asked to represent Nova Scotia\r\n  at the conferences on Confederation held in Charlottetown and Quebec City that\r\n  year and in London, England, in 1866. He is one of the Fathers of Confederation.\r\n  After his defeat in the 1867 federal election, he returned to private practice\r\n  in Halifax and was elected mayor of the city in 1870. He was appointed to the\r\n  Supreme Court of Canada on September 30, 1875 and served on the Court for 12\r\n  years. Justice Henry died on May 3, 1888, at the age of 71."
    },
    {
        "Names of Judges":"The Hon. Sir Henri-Elzéar Taschereau",
        "Date of Appointment":"1878-10-07",
        "Date of Departure":"1902-11-21  Footnote 1",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=henri-elzear-taschereau",
        "bio":"Henri-Elzéar Taschereau was born in Sainte-Marie-de-la-Beauce , Lower   Canada (Quebec), on October 7, 1836. He was the son of Pierre-Elzéar Taschereau and Catherine Hénédine Dionne . He received a classical education at the Petit Séminaire de Québec , then studied briefly at Laval University. Called to the bar in 1857, he practised law in Quebec City. One of his partners was his cousin, Jean-Thomas Taschereau , whom he later replaced on the Supreme Court of Canada. As was the tradition in his family, he entered politics and was elected to the Legislative Assembly of Canada in 1861. After his appointment to the Superior Court of Quebec in 1871, he wrote many legal texts, including an annotated edition of the Code of Civil Procedure of Lower Canada and a similar text on Canadian criminal law. He was appointed to the Supreme Court of Canada on October 7, 1878. During his years on the Court, he also taught law part-time at the University of Ottawa. On November\r\n  21, 1902, he was appointed Chief Justice of Canada. He served on the Supreme Court for 27 years, retiring on May 2, 1906. Chief Justice Taschereau died on April 14, 1911, at the age of 74."
    },
    {
        "Names of Judges":"The Hon. John Wellington Gwynne",
        "Date of Appointment":"1879-01-14",
        "Date of Departure":"1902-01-07",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=john-wellington-gwynne",
        "bio":"John Wellington Gwynne was born in Castleknock, Ireland, on March 30, 1814.\r\n  He was the son of William Gwynne and Eliza Nelson. After studying at Trinity\r\n  College in Dublin, he emigrated to Canada in 1832, at the age of 18. He enrolled\r\n  as a law student with the Law Society of Upper Canada then spent two years\r\n  articling with Thomas Kirkpatrick in Kingston, Upper Canada (Ontario). In 1834\r\n  he moved to Toronto where he completed his articles in the law office of Hagerman & Draper\r\n  and practised law after being called to the bar in 1837. His interests extended\r\n  beyond law; from 1845 to 1853, he was a railway promoter, founding the Toronto\r\n  and Guelph Railway Company, which eventually amalgamated with the Grand Trunk\r\n  Railway Company of Canada. In 1868 he was appointed to the Court of Common\r\n  Pleas. Three years later, he chaired a commission of inquiry into the fusion\r\n  of common law and equity, a controversial topic at the time. He was appointed\r\n  to the Ontario Court of Error and Appeal in 1874 and to the Supreme Court of\r\n  Canada on January 14, 1879. He served on the Supreme Court for 22 years. Justice\r\n  Gwynne died on January 7, 1902, at the age of 87."
    },
    {
        "Names of Judges":"The Hon. Christopher Salmon Patterson",
        "Date of Appointment":"1888-10-27",
        "Date of Departure":"1893-07-24",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=christopher-salmon-patterson",
        "bio":"Christopher Salmon Patterson was born in London, England, on January 16, 1823.\r\n  He was the son of John and Ann Patterson. After completing his studies at the\r\n  Royal Belfast Academical Institution in Ireland, he emigrated to Canada in\r\n  1845 and settled in Picton, Canada West (Ontario). Called to the bar in 1851,\r\n  he became a partner in the office of Philip Low, where he had served his articles\r\n  after his arrival in Canada. In 1856 he moved to Toronto, where he practised\r\n  law for 18 years with Wilson, Patterson & Beaty. He was appointed a member\r\n  of a commission of inquiry into the fusion of common law and equity in 1871.\r\n  Three years later, he was appointed to the Ontario Court of Error and Appeal,\r\n  and on October 27, 1888, he was elevated to the Supreme Court of Canada. He\r\n  served on the Supreme Court for four years. Justice Patterson died on July\r\n  24, 1893, at the age of 70."
    },
    {
        "Names of Judges":"The Hon. Robert Sedgewick",
        "Date of Appointment":"1893-02-18",
        "Date of Departure":"1906-08-04",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=robert-sedgewick",
        "bio":"Robert Sedgewick was born in Aberdeen, Scotland, on May 10, 1848. He was the\r\n  son of Robert Sedgewick and Jessie Middleton. His family moved to Nova Scotia\r\n  when he was a child. After graduating from Dalhousie University with a B.A.\r\n  in 1867, he articled in Cornwall, Ontario, in the office of John Sandfield\r\n  Macdonald. He was called to the bar of Ontario in 1872 and of Nova Scotia the\r\n  following year. He practised law in Halifax for 15 years, first with John James\r\n  Stewart, then with his brother, James Adam Sedgewick, and William Benjamin\r\n  Ross. In 1883 he helped found Dalhousie Law School, one of the first university\r\n  law schools in the British Empire to offer a degree in common law. He was among\r\n  the first professors at the school. In 1888 he moved to Ottawa to accept the\r\n  position of Deputy Minister of Justice. In that capacity, he played a major\r\n  role in the drafting of the first Canadian Criminal Code of 1892. He was appointed\r\n  to the Supreme Court of Canada on February 18, 1893 and served on the Court\r\n  for 13 years. Justice Sedgewick died on August 4, 1906, at the age of 58."
    },
    {
        "Names of Judges":"The Hon. George Edwin King",
        "Date of Appointment":"1893-09-21",
        "Date of Departure":"1901-05-08",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=george-edwin-king",
        "bio":"George Edwin King was born in Saint John, New Brunswick, on October 8, 1839.\r\n  He was the son of George King and Mary Ann Fowler. He attended Wesleyan University\r\n  in Connecticut, obtaining a B.A. in 1859 and an M.A. three years later. After\r\n  articling in the office of Robert Leonard Hazen in Saint John, he was called\r\n  to the bar of New Brunswick in 1865 and established his practice in his native\r\n  city. Soon after, he entered politics and was elected to the House of Assembly\r\n  of New Brunswick in 1867. He served as premier of the province for a short\r\n  time, from 1870 to 1871, when he was only 30, and again from 1872 to 1878,\r\n  serving also as attorney general from 1870 to 1878. Two years later, he was\r\n  appointed to the Supreme Court of New Brunswick. In 1892 and 1893 he also taught\r\n  law at the University of New Brunswick. He was appointed to the Supreme Court\r\n  of Canada on September 21, 1893 and served on the Court for seven years. Justice\r\n  King died on May 8, 1901, at the age of 61."
    },
    {
        "Names of Judges":"The Hon. Désiré Girouard",
        "Date of Appointment":"1895-09-28",
        "Date of Departure":"1911-03-22",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=desire-girouard",
        "bio":"Désiré Girouard was born in Saint-Timothée , Lower Canada\r\n  (Quebec), on July 7, 1836. He was the son of Jérémie Girouard\r\n  and Hyppolite Picard. After graduating from the Petit\r\n  Séminaire de Montréa l,\r\n  he went to McGill University in 1857 to study law. While a law student, he\r\n  completed his mandatory apprenticeship in the law office of Edward Carter.\r\n  In 1860 he graduated with a B.C.L., was called to the bar and settled in Montreal.\r\n  A prolific writer, he published an important legal text just before his call\r\n  to the bar, entitled Essai sur les lettres de\r\n  change et les billets promissoires ,\r\n  and he was, in 1871, one of the founding editors of the Revue\r\n  critique de législation\r\n  et de jurisprudence du Canada . He continued to write throughout his career,\r\n  producing several works on history and genealogy. He entered politics and was\r\n  a member of Parliament for 17 years, until 1895, making his mark as the sponsor\r\n  of a law that permitted a man to marry his deceased wife's sister. At the municipal\r\n  level, he became mayor of Dorval, Quebec, in 1892. He was appointed to the\r\n  Supreme Court of Canada on September 28, 1895, and he served on the Court for\r\n  15 years. Justice Girouard died on March 22, 1911, at the age of 74."
    },
    {
        "Names of Judges":"The Hon. Sir Louis Henry Davies",
        "Date of Appointment":"1901-09-25",
        "Date of Departure":"1918-10-23  Footnote 1",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=louis-henry-davies",
        "bio":"Louis Henry Davies was born in Charlottetown, Prince Edward Island, on May 4, 1845. He was the son of Benjamin Davies and Kezia Attwood Watts. He was educated at Prince of Wales College in Charlottetown and studied law at the Inner Temple in London, England. He was called to the English bar in 1866 and to the bar of Prince Edward Island in 1867, practising law in Charlottetown with Davies & Haszard. Elected to the Legislative Assembly of Prince Edward Island in 1872, he became premier and Attorney General of the province in 1876. That year, he represented the landowners of Prince Edward Island before the P.E.I. Land Commission, whose task was to resolve disputes arising from the purchase by the provincial government of land held by absentee owners. He left provincial politics in 1879 and was elected to the House of Commons three years later, serving as Minister of Marine and Fisheries from 1896 to 1901. On September 25, 1901, he was appointed to the Supreme Court of Canada, and on October 23, 1918 was named its chief justice. He served on the Court for 23 years. Chief Justice Davies died on May 1, 1924, at the age of 78."
    },
    {
        "Names of Judges":"The Hon. David Mills",
        "Date of Appointment":"1902-02-08",
        "Date of Departure":"1903-05-08",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=david-mills",
        "bio":"David Mills was born in the township of Orford, Upper Canada (Ontario), on\r\n  March 18, 1831. He was the son of Nathaniel Mills and Mary Guggerty. He was\r\n  educated at the local common school and became a teacher. In 1856 he was promoted\r\n  to Superintendent of Schools in Kent County. He began studying law at the University\r\n  of Michigan in 1865 and graduated two years later with an LL.B., but he was\r\n  not called to the Ontario bar until 1883. Turning to politics instead, he was\r\n  elected to the House of Commons in the Dominion's first elections in 1867 and\r\n  was a member of Parliament for a total of 27 years. He was Minister of the\r\n  Interior from 1876 to 1878 and Minister of Justice from 1897 to 1902, a position\r\n  he held in the Senate, to which he had been appointed in 1896. For five years\r\n  he was editor-in-chief for the London Advertiser, and in 1888 he became a professor\r\n  of constitutional and international law at the University of Toronto. He was\r\n  appointed to the Supreme Court of Canada on February 8, 1902, and served on\r\n  the Court for one year. Justice Mills died on May 8, 1903, at the age of 72."
    },
    {
        "Names of Judges":"The Hon. John Douglas Armour",
        "Date of Appointment":"1902-11-21",
        "Date of Departure":"1903-07-11",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=john-douglas-armour",
        "bio":"John Douglas Armour was born in the township of Otonabee, Upper Canada (Ontario),\r\n  on May 4, 1830. He was the son of Samuel Armour. After graduating with a B.A.\r\n  from the University of Toronto in 1850, he studied law in the office of his\r\n  brother, Robert Armour, then in that of P. M. M. VanKoughnet. He was called\r\n  to the bar in 1853 and practised in Cobourg, Canada West (Ontario), for 25\r\n  years, first with Sidney Smith and later with H. F. Holland. In 1877 he was\r\n  appointed to the Court of Queen's Bench of Ontario and was named its chief\r\n  justice in November 1887. In 1901 he became Chief Justice of Ontario. The following\r\n  year, on November 21, 1902, he was appointed to the Supreme Court of Canada.\r\n  Three months later, the imperial government appointed him to the Alaskan Boundary\r\n  Commission. He served on the Supreme Court for seven months. Justice Armour\r\n  died on July 11, 1903 at the age of 73, while working with the Commission in\r\n  London, England."
    },
    {
        "Names of Judges":"The Hon. Wallace Nesbitt",
        "Date of Appointment":"1903-05-16",
        "Date of Departure":"1905-10-03",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=wallace-nesbitt",
        "bio":"Wallace Nesbitt was born in Woodstock, Canada West (Ontario), on May 13, 1858.\r\n  He was the son of John W. Nesbitt and Mary Wallace. He studied at Woodstock\r\n  College, enrolled as a student at the Law Society of Upper Canada and articled\r\n  in Woodstock. Called to the bar in 1881, he practised law briefly in Hamilton,\r\n  Ontario. In 1882 he moved to Toronto, where he practised with McCarthy, Osler,\r\n  Hoskin & Creelman for 10 years before joining Beatty, Chadwick, Blackstock & Galt.\r\n  He was often called upon to argue before the Judicial Committee of the Privy\r\n  Council in London, England. On May 16, 1903, he was appointed to the Supreme\r\n  Court of Canada. He served on the Supreme Court for two years and resigned\r\n  on October 4, 1905. Justice Nesbitt died on April 7, 1930, at the age of 71."
    },
    {
        "Names of Judges":"The Hon. Albert Clements Killam",
        "Date of Appointment":"1903-08-08",
        "Date of Departure":"1905-02-05",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=albert-clements-killam",
        "bio":"Albert Clements Killam was born in Yarmouth, Nova Scotia, on September 18,\r\n  1849. He was the son of George Killam and Caroline Clements. After graduating\r\n  from the University of Toronto with a B.A. in 1872, he enrolled at the Law\r\n  Society of Upper Canada and articled with the Toronto firm of Crooks, Kingsmill & Cattanach\r\n  and was called to the bar of Ontario in 1877. He practised law in Windsor,\r\n  Ontario, for two years, and in 1879 moved to Winnipeg and was called to the\r\n  bar of Manitoba. In 1883 he was elected to the Legislative Assembly of Manitoba\r\n  but sat for only two years before being appointed to the Court of Queen's Bench\r\n  of Manitoba in 1885. He was a member of the panel that heard the appeal of Métis leader Louis\r\n  Riel in September of that year. In 1899 he was named\r\n  Chief Justice of Manitoba and on August 8, 1903, was appointed to the Supreme\r\n  Court of Canada. He served on the Supreme Court for a year and resigned on\r\n  February 6, 1905 to become Chief Commissioner of the Board of Railway Commissioners.\r\n  Justice Killam died on March 1, 1908, at the age of 58."
    },
    {
        "Names of Judges":"The Hon. John Idington",
        "Date of Appointment":"1905-02-10",
        "Date of Departure":"1927-03-30",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=john-idington",
        "bio":"John Idington was born in Puslinch, Upper Canada (Ontario), on October 14,\r\n  1840. He was the son of Peter Idington and Catherine Stewart. He studied at\r\n  the University of Toronto, graduating with an LL.B. in 1864. Called to the\r\n  bar the same year, he settled in Stratford, Canada West (Ontario), where he\r\n  practised for 40 years. Early in his career, he served as Crown Attorney and\r\n  Clerk of the Peace for the county of Perth. In 1894 and 1895 he was president\r\n  of the Western Bar Association. He was appointed to the High Court of Justice\r\n  of Ontario in 1904 and to the Supreme Court of Canada on February 10, 1905.\r\n  He served on the Supreme Court for 22 years and retired on March 31, 1927.\r\n  Justice Idington died on February 7, 1928, at the age of 87."
    },
    {
        "Names of Judges":"The Hon. James Maclennan",
        "Date of Appointment":"1905-10-05",
        "Date of Departure":"1909-02-12",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=james-maclennan",
        "bio":"James Maclennan was born in the township of Lancaster, Upper Canada (Ontario),\r\n  on March 17, 1833. He was the son of Roderick Maclennan and Mary Macpherson.\r\n  After graduating from Queen's University with a B.A. in 1849, he stayed in\r\n  Kingston, Canada West (Ontario), and enrolled with the Law Society of Upper\r\n  Canada as a law student in 1851. In 1854 he began articling in the office of\r\n  Alexander Campbell, Sir John A. Macdonald's former law partner. Called to the\r\n  bar in 1857, he practised law in Hamilton for two years before moving to Toronto\r\n  and joining Oliver Mowat to establish the law office of Mowat, Maclennan & Downey.\r\n  He had a short and stormy political career. He was elected to the House of\r\n  Commons in 1874, but the election was declared void shortly after. Later that\r\n  year, he was re-elected in a by-election, but that too was declared void in\r\n  the fall of 1875 and his opponent took over his seat. He returned to his law\r\n  practice and in 1888 was appointed to the Ontario Court of Appeal, a position\r\n  he held for 17 years. On October 5, 1905, he was appointed to the Supreme Court\r\n  of Canada. He served on the Supreme Court for three years and retired on February\r\n  13, 1909. Justice Maclennan died on June 9, 1915, at the age of 82."
    },
    {
        "Names of Judges":"The Hon. Lyman Poore Duff",
        "Date of Appointment":"1906-09-27",
        "Date of Departure":"1933-03-17  Footnote 1",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=lyman-poore-duff",
        "bio":"Lyman Poore Duff was born in Meaford, Canada West (Ontario), on January 7, 1865. He was the son of Charles Duff and Isabella Johnson. He attended the University of Toronto, earning a B.A. in 1887 and an LL.B. in 1889. To help pay for his studies, he taught mathematics. In 1893 he was called to the bar of Ontario and practised briefly in Fergus. He moved to Victoria the following year and was called to the bar of British Columbia in 1895. A member of the firm of Bodwell & Irving, in 1903 he was selected to serve as a junior counsel for Canada before the Alaskan Boundary Commission in London, England. He was appointed to the Supreme Court of British Columbia in 1904 and to the Supreme Court of Canada on September 27, 1906. On March 17, 1933, he became Chief Justice of Canada. He served on the Supreme Court for 37 years, retiring on January 7, 1944. Chief Justice Duff died on April 26, 1955, at the age of 90."
    },
    {
        "Names of Judges":"The Hon. Francis Alexander Anglin",
        "Date of Appointment":"1909-02-23",
        "Date of Departure":"1924-09-16  Footnote 1",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=francis-alexander-anglin",
        "bio":"Francis Alexander Anglin was born in Saint John, New Brunswick, on April 2, 1865. He\r\n  was the son of Timothy Warren Anglin and Ellen McTavish. After graduating from Collège Sainte-Marie in Montreal, he attended the University of Ottawa,\r\n  from which he obtained a B.A. in 1887. He enrolled as a law student with the\r\n  Law Society of Upper Canada and was called to the bar in 1888. He established\r\n  his practice in Toronto, eventually founding the law firm of Anglin & Mallon.\r\n  In 1896 he became Clerk of the Surrogate Court of Ontario. His publications\r\n  included Limitations of Actions against Trustees and Relief from Liability\r\n  for Technical\r\n  Breaches of Trust. He was appointed to the Exchequer Division of the High Court\r\n  of Justice of Ontario in 1904 and to the Supreme Court of Canada on February\r\n  23, 1909. On September 16, 1924, he became Chief Justice of Canada. He served\r\n  on the Supreme Court for 24 years, retiring on February 28, 1933. Chief Justice\r\n  Anglin died two days after his retirement, on March 2, 1933, at the age of\r\n  67."
    },
    {
        "Names of Judges":"The Hon. Louis-Philippe Brodeur",
        "Date of Appointment":"1911-08-11",
        "Date of Departure":"1923-10-09",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=louis-philippe-brodeur",
        "bio":"Louis-Philippe Brodeur was born in Beloeil, Canada East (Quebec), on August\r\n  21, 1862. He was the son of Toussaint Brodeur and Justine\r\n  Lambert . After graduating\r\n  from the Séminaire de Saint-Hyacinthe , he attended Laval University\r\n  in Montreal and obtained an LL.B. in 1884. Called to the bar later that year,\r\n  he settled in Montreal and worked with Honoré Mercier before establishing\r\n  the law firm of Dandurand et Brodeur . In 1891 he was elected to the House of\r\n  Commons. He was a member of Parliament for 20 years, and held the positions\r\n  of Speaker of the House, Minister of Inland Revenue, Minister of Marine and\r\n  Fisheries, and Minister of Naval Service. In the latter capacity, he introduced\r\n  a bill to create a Canadian navy in 1910. On August 11, 1911, he was appointed\r\n  to the Supreme Court of Canada. He served on the Court for 12 years, resigning\r\n  on October 10, 1923 to succeed Sir Charles Fitzpatrick as Lieutenant-Governor\r\n  of Quebec. Justice Brodeur died on January 2, 1924, at the age of 61."
    },
    {
        "Names of Judges":"The Hon. Pierre-Basile Mignault",
        "Date of Appointment":"1918-10-25",
        "Date of Departure":"1929-09-29",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=pierre-basile-mignault",
        "bio":"Pierre-Basile Mignault was born in Worcester, Massachusetts, on September\r\n  30, 1854. He was the son of Pierre-Basile Mignault and Catherine O'Callaghan.\r\n  While attending McGill University, he did the required legal clerkship in the\r\n  law office of Mousseau, Chapleau et Archambault . He graduated with a B.C.L.\r\n  degree in 1878 and was called to the bar the same year. In 1906 he was president\r\n  of the bar of Montreal, one of several positions he held in the 40 years he\r\n  practised law in the city. The author of many legal texts, including the Manuel\r\n  de droit parlementaire , the Traité de droit paroissial and the classic\r\n  nine-volume Traité de droit civil , he taught civil law at McGill University\r\n  part-time for six years. In 1914 he was appointed to the International Joint\r\n  Commission, on which he sat for four years. On October 25, 1918, he was appointed\r\n  to the Supreme Court of Canada. He served on the Court for 10 years, retiring\r\n  on September 30, 1929. Justice Mignault died on October 15, 1945, at the age\r\n  of 91."
    },
    {
        "Names of Judges":"The Hon. Arthur Cyrille Albert Malouin",
        "Date of Appointment":"1924-01-30",
        "Date of Departure":"1924-09-30",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=arthur-cyrille-albert-malouin",
        "bio":"Arthur Cyrille Albert Malouin was born in Quebec City, Canada East (Quebec),\r\n  on March 13, 1857. He was the son of Jacques\r\n  Malouin and Marie-Angélique Suzor. He received a classical education at the Séminaire de Québec ,\r\n  then studied law at Laval University, obtaining an LL.B. in 1882. Called to\r\n  the bar later that year, he joined the law office of Malouin,\r\n  Montambault & Malouin in Quebec City. He practised law in his native city for 23 years, eventually\r\n  becoming Crown Attorney for the district of Quebec. In 1898 he was elected\r\n  to the House of Commons in a by-election. He was re-elected in 1900 and 1904,\r\n  but he left politics in 1905 to accept an appointment to the Superior Court\r\n  of Quebec. He was elevated to the Supreme Court of Canada on January 30, 1924\r\n  and served on the Court for eight months, retiring on October 1, 1924. Justice Malouin died on April 5, 1936, at the age of 79."
    },
    {
        "Names of Judges":"The Hon. Edmund Leslie Newcombe",
        "Date of Appointment":"1924-09-16",
        "Date of Departure":"1931-12-09",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=edmund-leslie-newcombe",
        "bio":"Edmund Leslie Newcombe was born in Cornwallis, Nova Scotia, on February 17,\r\n  1859. He was the son of John Cumming Newcombe and Abigail H. Calkin. He received\r\n  his B.A. in 1878 and M.A. in 1881 from Dalhousie University, and his LL.B.\r\n  in 1881 from the short-lived University of Halifax. Called to the bar of Nova\r\n  Scotia the following year, he practised law in Kentville until 1886, when he\r\n  moved to Halifax to establish the law firm of Meagher, Drysdale & Newcombe.\r\n  He was also appointed Lecturer on Marine Insurance Law at Dalhousie University\r\n  in 1892. In 1893 he moved to Ottawa to become Deputy Minister of Justice and\r\n  was called to the bar of Ontario. He was Deputy Minister for over 30 years\r\n  and frequently pleaded before the Judicial Committee of the Privy Council in\r\n  London, England. In 1914 he acted as counsel for the Government of Canada in\r\n  the public inquiry into the sinking of the S.S. Empress of Ireland. He was\r\n  appointed to the Supreme Court of Canada on September 16, 1924 and served on\r\n  the Court for seven years. Justice Newcombe died on December 9, 1931, at the\r\n  age of 72."
    },
    {
        "Names of Judges":"The Hon. Thibaudeau Rinfret",
        "Date of Appointment":"1924-10-01",
        "Date of Departure":"1944-01-08  Footnote 1",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=thibaudeau-rinfret",
        "bio":"Thibaudeau Rinfret was born in Montreal, Quebec, on June 22, 1879. He was\r\n  the son of François-Olivier Rinfret and Albina\r\n  Pominville . He completed\r\n  a B.A. at Collège Sainte-Marie in Montreal in 1897, then studied law\r\n  at Laval University in Montreal and McGill University, from which he graduated\r\n  with a B.C.L. in 1900. Called to the bar of Quebec in 1901, he practised in\r\n  the province for 21 years, in Saint-Jérome until 1910 and then in Montreal\r\n  with Perron, Taschereau, Rinfret, Vallée & Genest . He also taught\r\n  part-time at McGill University for over 10 years, specializing in commercial\r\n  law. He was appointed to the Superior Court of Quebec in 1922 and elevated\r\n  to the Supreme Court of Canada on October 1, 1924. On January 8, 1944, he became\r\n  Chief Justice of Canada. He served on the Supreme Court for 29 years and retired\r\n  on June 22, 1954. Chief Justice Rinfret died on July 25, 1962, at the age of\r\n  83."
    },
    {
        "Names of Judges":"The Hon. John Henderson Lamont",
        "Date of Appointment":"1927-04-02",
        "Date of Departure":"1936-03-10",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=john-henderson-lamont",
        "bio":"John Henderson Lamont was born in Horning's Mills, Canada West (Ontario),\r\n  on November 12, 1865. He was the son of Duncan Carmichael Lamont and Margaret\r\n  Robson Henderson. He graduated from the University of Toronto with a B.A. in\r\n  1892 and an LL.B. in 1893. The same year, he was called to the bar of Ontario.\r\n  He practised law in Toronto for six years before moving to Prince Albert, Northwest\r\n  Territories, where he eventually founded the law firm of Lamont & Turgeon .\r\n  In 1902 he became Crown Prosecutor and two years later was elected to represent\r\n  Saskatchewan in the House of Commons. He resigned that position in 1905 to\r\n  represent Prince Albert in the legislative assembly of the newly created province\r\n  of Saskatchewan. Shortly after, he was sworn in as Saskatchewan's Attorney\r\n  General. He was appointed to the Supreme Court of Saskatchewan in 1907 and\r\n  served on the Court for almost 20 years. On April 2, 1927, he was appointed\r\n  to the Supreme Court of Canada, serving on the Court for eight years. Justice Lamont died on March 10, 1936, at the age of 70."
    },
    {
        "Names of Judges":"The Hon. Robert Smith",
        "Date of Appointment":"1927-05-18",
        "Date of Departure":"1933-12-06",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=robert-smith",
        "bio":"Robert Smith was born in Lanark County, Canada West (Ontario), on December\r\n  7, 1858. He was the son of William Smith and Jean Neilson. In 1880 he enrolled\r\n  with the Law Society of Upper Canada as a law student. Called to the bar in\r\n  1885, he settled in Cornwall, Ontario, where he practised law for 37 years.\r\n  As director, secretary-treasurer and one of the principal shareholders in the\r\n  Montreal and Cornwall Navigation Company Ltd., he helped promote transportation\r\n  on the St. Lawrence River. In 1908 he was elected to the House of Commons and\r\n  was a member of Parliament for three years. He became a judge in 1922, when\r\n  he was appointed to the High Court Division of the Supreme Court of Ontario.\r\n  The following year, he was elevated to the Appellate Division, and in 1926\r\n  he was asked to sit on the Supreme Court of Canada as an ad hoc judge. On May\r\n  18, 1927, he was appointed to the Supreme Court of Canada. He served on the\r\n  Court for six years before his retirement on December 7, 1933. Justice Smith\r\n  died on March 18, 1942, at the age of 83."
    },
    {
        "Names of Judges":"The Hon. Lawrence Arthur Dumoulin Cannon",
        "Date of Appointment":"1930-01-14",
        "Date of Departure":"1939-12-25",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=lawrence-arthur-dumoulin-cannon",
        "bio":"Lawrence Arthur Dumoulin Cannon was born in Arthabaska, Quebec, on April 28,\r\n  1877. He was the son of Lawrence John Cannon and Aurélie Dumoulin . He\r\n  received a classical education at the Séminaire de Québec , then\r\n  attended Laval University, obtaining a B.A. in 1896 and an LL.L. three years\r\n  later. Called to the bar in 1899, he joined the law firm of Fitzpatrick, Parent,\r\n  Taschereau & Roy in Quebec City. Two of his associates, Sir Charles Fitzpatrick\r\n  and Robert Taschereau , later became chief justices of Canada. In 1908 he entered\r\n  politics and served eight years on the city council of Quebec City before his\r\n  election to the Legislative Assembly of Quebec in 1916. He returned to private\r\n  practice in 1923 and became president of the bar of Quebec the following year.\r\n  He was appointed to the Court of King's Bench of Quebec in 1927 and elevated\r\n  to the Supreme Court of Canada on January 14, 1930. He served on the Supreme\r\n  Court for nine years. Justice Cannon died on December 25, 1939, at the age\r\n  of 62."
    },
    {
        "Names of Judges":"The Hon. Oswald Smith Crocket",
        "Date of Appointment":"1932-09-21",
        "Date of Departure":"1943-04-12",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=oswald-smith-crocket",
        "bio":"Oswald Smith Crocket was born in Chatham, New Brunswick, on April 13, 1868.\r\n  He was the son of William Crocket and Marion Caldwell. He graduated from the\r\n  University of New Brunswick with a B.A. in 1886, then studied law for five\r\n  years while working as the Fredericton correspondent for the Saint John Globe.\r\n  He was called to the bar in 1892 and later founded the law firm of Phinney & Crocket\r\n  in Fredericton, but he continued to work as a journalist part-time until 1904,\r\n  the year he was elected to the House of Commons. He was a member of Parliament\r\n  for nine years, resigning in 1913 to accept an appointment to the Court of\r\n  King's Bench Division of the Supreme Court of New Brunswick. Three years later,\r\n  he was also named Judge of the Court of Divorce and Matrimonial Causes of New\r\n  Brunswick. On September 21, 1932, he was appointed to the Supreme Court of\r\n  Canada. He served on the Supreme Court for 11 years and retired on April 13,\r\n  1943. Justice Crocket died on March 2, 1945, at the age of 76."
    },
    {
        "Names of Judges":"The Hon. Frank Joseph Hughes",
        "Date of Appointment":"1933-03-17",
        "Date of Departure":"1935-02-12",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=frank-joseph-hughes",
        "bio":"Frank Joseph Hughes was born in the township of Peel, Ontario, on November\r\n  26, 1883. He was the son of James Hughes and Winnifred Mullarkey. After graduating\r\n  from the Ontario Normal College he became a teacher, and he continued to teach\r\n  while going to university. He obtained a B.A. from Queen's University in 1907,\r\n  then moved to Toronto to study law at Osgoode Hall Law School. He enrolled\r\n  as a law student in 1908, articled with William Buckingham in Guelph and was\r\n  called to the bar in 1911. For five years, he was Assistant Crown Attorney\r\n  for the County of York, Ontario, then in 1921 he held the position of Crown\r\n  Attorney for a brief period. Shortly after, he established the law firm of\r\n  Hughes & Agar in Toronto. He was appointed to the Supreme Court of Canada\r\n  on March 17, 1933 and served on the Court for almost two years, resigning on\r\n  February 13, 1935. Justice Hughes died on April 14, 1967, at the age of 83."
    },
    {
        "Names of Judges":"The Hon. Henry Hague Davis",
        "Date of Appointment":"1935-01-31",
        "Date of Departure":"1944-06-30",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=henry-hague-davis",
        "bio":"Henry Hague Davis was born in Brockville, Ontario, on September 10, 1885.\r\n  He was the son of William Henry Davis and Eliza Dowsley. He studied at the\r\n  University of Toronto, obtaining a B.A. in 1907, an M.A. in 1909 and an LL.B.\r\n  in 1911. Called to the bar in 1911, he joined the law firm of Kilmer, McAndrew & Irving\r\n  in Toronto, where he practised for 22 years. He was appointed to the Ontario\r\n  Court of Appeal in 1933 and to the Supreme Court of Canada on January 31, 1935.\r\n  Maintaining his involvement with the Canadian Bar Association, he became its\r\n  president in 1935. In 1938 he chaired the Royal Commission on the Bren Machine\r\n  Gun Contract. He served on the Supreme Court for nine years. Justice Davis\r\ndied on June 30, 1944, at the age of 58."
    },
    {
        "Names of Judges":"The Hon. Patrick Kerwin",
        "Date of Appointment":"1935-07-20",
        "Date of Departure":"1954-07-01  Footnote 1",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=patrick-kerwin",
        "bio":"Patrick Kerwin was born in Sarnia, Ontario, on October 25, 1889. He was the\r\n  son of Patrick Kerwin and Ellen Gavin. After graduating from the Sarnia Collegiate\r\n  Institute at the age of 16, he enrolled at Osgoode Hall Law School in 1906.\r\n  He articled in Sarnia with R. V. Le Sueur but, after being called to the bar\r\n  in 1911, decided to move to Guelph, where he practised law for over 21 years\r\n  with Guthrie & Guthrie. During that time, he served as solicitor for the\r\n  city of Guelph and Wellington County, as well as Crown prosecutor. In 1932\r\n  he was appointed to the High Court of Justice of Ontario. Three years later,\r\n  on July 20, 1935, he was appointed to the Supreme Court of Canada. He served\r\n  on the Supreme Court for 27 years, becoming Chief Justice of Canada on July\r\n  1, 1954. Chief Justice Kerwin died on February 2, 1963, at the age of 73."
    },
    {
        "Names of Judges":"The Hon. Albert Blellock Hudson",
        "Date of Appointment":"1936-03-24",
        "Date of Departure":"1947-01-06",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=albert-blellock-hudson",
        "bio":"Albert Blellock Hudson was born in Pembroke, Ontario, on August 21, 1875.\r\n  He was the son of Albert Hudson and Elizabeth Blellock. When he was three years\r\n  old, his family moved to Portage la Prairie , Manitoba. He was educated there\r\n  and in Winnipeg, and obtained an LL.B. from the University of Manitoba in 1898.\r\n  Called to the bar the following year, he settled in Winnipeg, where he later\r\n  founded the law firm of Hudson, Ormond & Marlatt, with which he practised\r\n  for over 31 years. In 1914 he was elected to the Legislative Assembly of Manitoba.\r\n  Re-elected in 1915, he served as Attorney General and Minister of Telegraphs\r\n  and Telephones in the provincial cabinet until 1917. In 1921, after a few years\r\n  away from politics, he was elected to the House of Commons. He did not run\r\n  in the 1925 elections, choosing instead to practise law. He was appointed to\r\n  the Supreme Court of Canada on March 24, 1936 and served on the Court for 10\r\n  years. Justice Hudson died on January 6, 1947, at the age of 71."
    },
    {
        "Names of Judges":"The Hon. Robert Taschereau",
        "Date of Appointment":"1940-02-09",
        "Date of Departure":"1963-04-22  Footnote 1",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=robert-taschereau",
        "bio":"Robert Taschereau was born in Quebec City, Quebec, on September 10, 1896.\r\n  He was the son of Louis-Alexandre Taschereau and Aline\r\n  Dionne , and the grandson\r\n  of Jean-Thomas Taschereau , who had been a judge on the Supreme Court of Canada.\r\n  He studied at Laval University, earning a B.A. in 1916 and an LL.L. four years\r\n  later. Called to the bar in 1920, he joined his father's law firm, Taschereau,\r\n  Roy, Cannon, Parent & Casgrai n, in Quebec City. He also taught criminal\r\n  law part-time at Laval for 11 years. In keeping with family tradition, he entered\r\n  politics and was elected to the Legislative Assembly of Quebec in 1930. He\r\n  was a member of the Assembly until 1936. On February 9, 1940, he was appointed\r\n  to the Supreme Court of Canada, filling the vacancy created by the death of\r\n  his former law partner, Lawrence Cannon. In 1946, along with his colleague\r\n  on the Court, Justice Kellock, he co-chaired the Royal Commission on Spying\r\n  Activities in Canada, which was set up as a result of the so-called \"Gouzenko\r\n  Affair.\" On April 22, 1963, he was appointed Chief Justice of Canada.\r\n  He served on the Supreme Court for 27 years, retiring on September 1, 1967.\r\n  Chief Justice Taschereau died on July 26, 1970, at the age of 73."
    },
    {
        "Names of Judges":"The Hon. Ivan Cleveland Rand",
        "Date of Appointment":"1943-04-22",
        "Date of Departure":"1959-04-26",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=ivan-cleveland-rand",
        "bio":"Ivan Cleveland Rand was born in Moncton, New Brunswick, on April 27, 1884.\r\n  He was the son of Nelson Rand and Minnie Turner. He worked five years for the\r\n  Intercolonial Railway before attending Mount Allison University, from which\r\n  he obtained a B.A. in 1909. Three years later, he earned an LL.B. from Harvard\r\n  Law School. He was called to the bar of New Brunswick in 1912 but decided to\r\n  move to Medicine Hat, Alberta, where he practised law for seven years. In 1920\r\n  he moved back to Moncton and later became counsel for the Canadian National\r\n  Railways. He was named Attorney General of New Brunswick in 1924 and was a\r\n  member of the Legislative Assembly from February to June 1925. On April 22,\r\n  1943, he was appointed to the Supreme Court of Canada. Two years later, he\r\n  developed what is known as the \"Rand formula,\" a mechanism for levying\r\n  union dues, while acting as arbitrator in a Ford labour dispute. In 1947 he\r\n  was also a member of the United Nations Special Committee on Palestine. He\r\n  served on the Supreme Court for 16 years and retired on April 27, 1959. Justice\r\n  Rand died on January 2, 1969, at the age of 84."
    },
    {
        "Names of Judges":"The Hon. Roy Lindsay Kellock",
        "Date of Appointment":"1944-10-03",
        "Date of Departure":"1958-01-14",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=roy-lindsay-kellock",
        "bio":"Roy Lindsay Kellock was born in Perth, Ontario, on November 12, 1893. He was\r\n  the son of James Francis Kellock and Annie McDonald. He graduated from McMaster\r\n  University with a B.A. in 1915 and began articling in 1917 with R. E. Gray\r\n  in Toronto. Called to the bar in 1920, he joined Donald, Mason, White & Foulds\r\n  in Toronto, where he practised law for 22 years. He was appointed to the Ontario\r\n  Court of Appeal in 1942 and to the Supreme Court of Canada on October 3, 1944.\r\n  During his term on the Supreme Court, he often acted as arbitrator or conciliator\r\n  in railway labour disputes across Canada. With his colleague, Justice Robert\r\n  Taschereau , he co-chaired the 1946 Royal Commission on Spying Activities in\r\n  Canada, which was set up as a result of the so-called \"Gouzenko Affair.\" He\r\n  served on the Supreme Court for 13 years and retired on January 15, 1958. Justice\r\n  Kellock died on December 12, 1975, at the age of 82."
    },
    {
        "Names of Judges":"The Hon. James Wilfred Estey",
        "Date of Appointment":"1944-10-06",
        "Date of Departure":"1956-01-22",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=james-wilfred-estey",
        "bio":"James Wilfred Estey was born in Keswick Ridge, New Brunswick, on December\r\n  1, 1889. He was the son of Byron Leslie Estey and Sarah Ann Kee. After graduating\r\n  from the University of New Brunswick with a B.A. in 1910, he studied law at\r\n  Harvard University and obtained an LL.B. in 1915. When he returned to Canada,\r\n  he moved to Saskatoon to teach law and economics at the University of Saskatchewan,\r\n  where he was a lecturer for 10 years. In 1917 he was called to the bar and\r\n  established his law practice in Saskatoon, eventually founding the firm of\r\n  Estey, Moxon, Schmitt & McDonald. He served as Crown Prosecutor in Saskatoon\r\n  for eight years, until 1929. In 1934 he was elected to the Legislative Assembly\r\n  of Saskatchewan. During his 10 years as a member of the Assembly, he was Minister\r\n  of Education for seven years and Attorney General for five years. He was appointed\r\n  to the Supreme Court of Canada on October 6, 1944 and served on the Court for\r\n  11 years. Justice Estey died on January 22, 1956, at the age of 66."
    },
    {
        "Names of Judges":"The Hon. Charles Holland Locke",
        "Date of Appointment":"1947-06-03",
        "Date of Departure":"1962-09-15",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=charles-holland-locke",
        "bio":"Charles Holland Locke was born in Morden, Manitoba, on September 16, 1887.\r\n  He was the son of Corbet Locke and Esther Alice Holland. After completing his\r\n  studies at the Morden Public Schools, he began his legal apprenticeship in\r\n  a local law firm. A year later, he moved to Winnipeg to finish his articles\r\n  in the office of Albert Blellock Hudson, a future Supreme Court of Canada judge.\r\n  In 1910 he was called to the bar of Manitoba and joined the law firm of Machray,\r\n  Sharpe & Dennistoun in Winnipeg. He practised law for a few years, then\r\n  enlisted in the armed forces and served overseas in the First World War. Awarded\r\n  the Military Cross, upon his return he resumed his practice in Winnipeg. In\r\n  1928 he was called to the bar of British Columbia and joined the law firm of\r\n  Mayers, Lane & Thomson in Vancouver. On June 3, 1947, he was appointed\r\n  to the Supreme Court of Canada, filling the vacancy created by the death of\r\n  his mentor, Justice Hudson. He served on the Supreme Court for 15 years and\r\n  retired on September 16, 1962. Justice Locke died on May 30, 1980, at the age\r\n  of 92."
    },
    {
        "Names of Judges":"The Hon. John Robert Cartwright",
        "Date of Appointment":"1949-12-22",
        "Date of Departure":"1967-09-01  Footnote 1",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=john-robert-cartwright",
        "bio":"John Robert Cartwright was born in Toronto, Ontario, on March 23, 1895. He \r\n  was the son of James Strachan Cartwright and Jane Elizabeth Young. After graduating \r\n  from Upper Canada College in 1912, he enrolled at Osgoode Hall Law School and \r\n  began his articles with Smith, Rae & Greer. He interrupted his studies in \r\n  1914 to serve overseas with the armed forces during the First World War. In \r\n  1915 he was wounded twice and for the following two years was an aide-de-camp to three successive generals. He was awarded the Military Cross in 1917. Upon \r\n  his return to Canada, he resumed his study of law. He was called to the bar \r\n  in 1920, then joined the firm of Smith, Rae & Greer in Toronto. In 1947 \r\n  he was counsel for the Government of Canada in the prosecutions that resulted \r\n  from the findings of the Royal Commission on Spying Activities in Canada, which \r\n  had been chaired by judges Taschereau and Kellock. He was appointed to the Supreme \r\n  Court of Canada on December 22, 1949 and became its chief justice on September \r\n  1, 1967. He served on the Supreme Court for 20 years and retired on March 23, \r\n  1970. He is invested as a Companion to the Order of Canada in 1970 for service \r\n  in the profession of law. Chief Justice Cartwright died on November 24, 1979, \r\n  at the age of 84."
    },
    {
        "Names of Judges":"The Hon. Joseph Honoré Gérald Fauteux",
        "Date of Appointment":"1949-12-22",
        "Date of Departure":"1970-03-23  Footnote 1",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=joseph-honore-gerald-fauteux",
        "bio":"Joseph Honoré Gérald Fauteux was born in Saint-Hyacinthe , Quebec, \r\n  on October 22, 1900. He was the son of Homère Fauteux and Héva \r\n  Mercier . He studied at the University of Montreal and graduated with an LL.L. \r\n  in 1925. Called to the bar that year, he settled in Montreal, where he practised \r\n  with his uncle, Honoré Mercier , forming the law firm of Mercier & \r\n  Fauteux . From 1930 to 1936, he was Crown Prosecutor for Montreal, and in 1939 \r\n  he became Chief Crown Prosecutor of the province of Quebec. In 1946 he was associated \r\n  with the Royal Commission on Spying Activities in Canada, acting as a legal \r\n  adviser. For 14 years, he taught criminal law as a sessional lecturer at McGill \r\n  University and was dean of the Faculty of Law from 1949 to 1950. He was appointed \r\n  to the Superior Court of Quebec in 1947 and to the Supreme Court of Canada on \r\n  December 22, 1949. He was also one of the founders of the Faculty of Law of \r\n  the University of Ottawa, serving as dean from 1953 to 1962. On March 23, 1970, \r\n  he was named Chief Justice of Canada. He served on the Supreme Court for 24 \r\n  years, retiring on December 23, 1973. Chief Justice Fauteux died on September \r\n  14, 1980, at the age of 79."
    },
    {
        "Names of Judges":"The Hon. Douglas Charles Abbott",
        "Date of Appointment":"1954-07-01",
        "Date of Departure":"1973-12-22",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=douglas-charles-abbott",
        "bio":"Douglas Charles Abbott was born in Lennoxville, Quebec, on May 29, 1899. He\r\n  was the son of Lewis Duff Abbott and Mary Jane Pearce. After graduating from\r\n  Bishop's University with a B.A., he went to McGill University to study law.\r\n  Shortly after beginning his studies, he enlisted in the armed forces in 1916\r\n  and served overseas during the First World War until 1918. Upon his return,\r\n  he completed his B.C.L., then went to France to study law at the University\r\n  of Dijon. Once back in Canada, he was called to the bar in 1921 and joined\r\n  the law firm of Fleet, Phelan, Fleet & Le\r\n  Mesurier in Montreal. In 1940\r\n  he entered politics and was elected to the House of Commons. He was a member\r\n  of Parliament for 14 years, serving as Minister of National Defence near the\r\n  end of the Second World War and Minister of Finance from 1946 to 1954. On July\r\n  1, 1954, he was appointed to the Supreme Court of Canada. He served on the\r\n  Court for 19 years and retired on December 23, 1973. Justice Abbott died on\r\n  March 17, 1987, at the age of 87."
    },
    {
        "Names of Judges":"The Hon. Henry Grattan Nolan",
        "Date of Appointment":"1956-03-01",
        "Date of Departure":"1957-07-08",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=henry-grattan-nolan",
        "bio":"Henry Grattan Nolan was born in Calgary, Alberta, on May 5, 1893. He was the\r\n  son of Patrick James Nolan and Mary Elizabeth Lee. After graduating from the\r\n  University of Alberta with a B.A. in 1914, he enlisted in the armed forces\r\n  and served in Europe during the First World War. He was wounded at Cambrai,\r\n  France, and received the Military Cross in 1918. After the war, he attended\r\n  Oxford University as a Rhodes Scholar and earned a further B.A. in 1921. Called\r\n  to the English bar and the bar of Alberta in 1922, he settled in Calgary and\r\n  joined the law firm of Bennett, Hannah & Sanford. During the Second World\r\n  War, he acted as deputy to the Canadian Army Judge Advocate General, and at\r\n  the end of the war he was chosen to be the Canadian prosecutor before the International\r\n  Military Tribunal trying war criminals in the Far East. On March 1, 1956, he\r\n  was appointed to the Supreme Court of Canada, on which he served for one year.\r\n  Justice Nolan died on July 8, 1957, at the age of 64."
    },
    {
        "Names of Judges":"The Hon. Ronald Martland",
        "Date of Appointment":"1958-01-15",
        "Date of Departure":"1982-02-09",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=ronald-martland",
        "bio":"Ronald Martland was born in Liverpool, England, on February 10, 1907. He was\r\n  the son of John Martland and Ada Wild. When he was four years old, his family\r\n  emigrated to Canada and settled in Edmonton. He graduated from high school\r\n  at the age of 14, but he was too young to attend university, so he worked as\r\n  a page in the Alberta Legislature for two years. He then attended the University\r\n  of Alberta and obtained a B.A. in 1926 and an LL.B. two years later. Awarded\r\n  a Rhodes Scholarship, he pursued his studies at Oxford University, earning\r\n  a B.A. there in 1930 and a B.C.L. in 1931. Upon his return to Edmonton in 1932,\r\n  he was called to the bar of Alberta and joined the law firm of Milner, Carr,\r\n  Dafoe & Poirier , with which he practised for over 25 years. On January\r\n  15, 1958, he was appointed to the Supreme Court of Canada. He served on the\r\n  Court for 24 years and retired on February 10, 1982. Justice Martland died\r\n  on November 20, 1997, at the age of 90."
    },
    {
        "Names of Judges":"The Hon. Wilfred Judson",
        "Date of Appointment":"1958-02-05",
        "Date of Departure":"1977-07-19",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=wilfred-judson",
        "bio":"Wilfred Judson was born in Todmorden, England, on July 20, 1902. He was the\r\n  son of John and Agnes Judson. He studied at the University of Manchester, England,\r\n  obtaining a B.A. in 1922 and an M.A. the following year. In 1923 he emigrated\r\n  to Canada. He taught Latin in a Toronto school before attending Osgoode Hall\r\n  Law School. Called to the bar in 1932, he practised law in Toronto for 19 years,\r\n  first with Aylesworth, Thompson, Garden & Stuart, then with Daly, Hamilton & Thistle.\r\n  He was appointed to the High Court of Justice of Ontario in 1951 and to the\r\n  Supreme Court of Canada on February 5, 1958. He served on the Supreme Court\r\n  for 19 years, retiring on July 20, 1977. Justice Judson died on June 15, 1980,\r\n  at the age of 77."
    },
    {
        "Names of Judges":"The Hon. Roland Almon Ritchie",
        "Date of Appointment":"1959-05-05",
        "Date of Departure":"1984-10-30",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=roland-almon-ritchie",
        "bio":"Roland Almon Ritchie was born in Halifax, Nova Scotia, on June 19, 1910. He\r\n  was the son of William Bruce Almon Ritchie and Lillian Stewart. After graduating\r\n  from the University of King's College with a B.A. in 1930, he went to Oxford\r\n  University, where he earned a further B.A. in 1932. He returned to Halifax\r\n  and was called to the bar in 1934. He practised law for a few years with Stewart,\r\n  Smith, MacKeen & Rogers, then enlisted in the armed forces and went overseas\r\n  during the Second World War. From 1941 to 1944, he served as Assistant Deputy\r\n  Judge Advocate with the Third Canadian Division. Upon his return to Canada,\r\n  he resumed his practice in Halifax and helped found the law firm of Daley,\r\n  Phinney & Ritchie. He also lectured on insurance law at Dalhousie University\r\n  for 12 years and acted as counsel to the royal commission on the terms of Newfoundland's\r\n  union with Canada in 1949. On May 5, 1959, he was appointed to the Supreme\r\n  Court of Canada. He served on the Court for 25 years, retiring on October 31,\r\n  1984. Justice Ritchie died on June 5, 1988, at the age of 77."
    },
    {
        "Names of Judges":"The Hon. Emmett Matthew Hall",
        "Date of Appointment":"1962-11-23",
        "Date of Departure":"1973-02-28",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=emmett-matthew-hall",
        "bio":"Emmett Matthew Hall was born in Saint-Colomban, Quebec, on November 29, 1898.\r\n  He was the son of James Hall and Alice Shea. In 1910 his family moved to Saskatoon.\r\n  While studying law at the University of Saskatchewan, he supported himself\r\n  by teaching French in local schools. He graduated with an LL.B. in 1919 and\r\n  was called to the bar three years later. A partner in the law firm of Hall & Maguire,\r\n  he became president of the Law Society of Saskatchewan in 1952. He also lectured\r\n  on law at the University of Saskatchewan until 1957, the year he was appointed\r\n  Chief Justice of the Court of Queen's Bench of Saskatchewan. Four years later,\r\n  he became Chief Justice of Saskatchewan, and he was subsequently named chairman\r\n  of the Royal Commission on Health Services, which recommended the creation\r\n  of a universal health care system. He is therefore known as the father of Canadian\r\n  medicare. On November 23, 1962, he was appointed to the Supreme Court of Canada.\r\n  He served on the Court for 10 years and retired on March 1, 1973. Justice Hall\r\n  died on November 12, 1995, at the age of 96."
    },
    {
        "Names of Judges":"The Hon. Wishart Flett Spence",
        "Date of Appointment":"1963-05-30",
        "Date of Departure":"1978-12-28",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=wishart-flett-spence",
        "bio":"Wishart Flett Spence was born in Toronto, Ontario, on March 9, 1904. He was\r\n  the son of James Houston Spence and Margaret Hackland. He graduated from the\r\n  University of Toronto with a B.A. in political science in 1925, then attended\r\n  Osgoode Hall Law School. Called to the bar in 1928, he pursued his studies\r\n  at Harvard Law School and obtained an LL.M. in 1929. He practised law in Toronto\r\n  with Starr, Spence & Hall until 1934 and later with Spence, Shoemaker & Spence.\r\n  He was also a part-time lecturer at Osgoode Hall until 1946. In 1950 he was\r\n  appointed to the High Court of Justice of Ontario, and on May 30, 1963, he\r\n  was elevated to the Supreme Court of Canada. Three years later, he chaired\r\n  the royal commission investigating the controversial Munsinger espionage case.\r\n  He served on the Supreme Court for 15 years and retired on December 29, 1978.\r\n  Justice Spence died on April 16, 1998, at the age of 94."
    },
    {
        "Names of Judges":"The Hon. Louis-Philippe Pigeon",
        "Date of Appointment":"1967-09-21",
        "Date of Departure":"1980-02-07",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=louis-philippe-pigeon",
        "bio":"Louis-Philippe Pigeon was born in Henryville, Quebec, on February 8, 1905.\r\n  He was the son of Arthur Pigeon and Maria\r\n  Demers . He studied at Laval University\r\n  and obtained an LL.L. in 1928. Called to the bar that year, he settled in Quebec\r\n  City and practised law with St-Laurent, Gagné, Devlin et Taschereau .\r\n  In 1940 he became Law Clerk of the Quebec Legislature, a position he held for\r\n  four years before joining the law firm of Germain,\r\n  Lapointe, Thibaudeau et Roberge . He taught constitutional law part-time at Laval University for 15\r\n  years and was chairman of the National Council on the Administration of Justice\r\n  from 1963 to 1967. He also acted as a legal adviser to the Premier of Quebec,\r\n  Jean Lesage, from 1960 to 1966. On September 21, 1967, he was appointed to\r\n  the Supreme Court of Canada. He served on the Court for 12 years and retired\r\n  on February 8, 1980. Justice Pigeon died on February 23, 1986, at the age of\r\n  81."
    },
    {
        "Names of Judges":"The Hon. Bora Laskin",
        "Date of Appointment":"1970-03-19",
        "Date of Departure":"1973-12-27  Footnote 1",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=bora-laskin",
        "bio":"Bora Laskin was born in Fort William (Thunder Bay), Ontario, on October 5,\r\n  1912. He was the son of Max Laskin and Bluma Zingel. After graduating with\r\n  a B.A. from the University of Toronto in 1933, he enrolled at Osgoode Hall\r\n  Law School. From 1933 to 1936, he served his articles and continued to study\r\n  at the University of Toronto, earning an M.A. in 1935 and an LL.B. in 1936.\r\n  The following year, he received an LL.M. from Harvard Law School. Upon his\r\n  return to Toronto that year, he was called to the bar and began his legal career\r\n  writing headnotes for The Canadian Abridgement. In 1940 he embarked on a teaching\r\n  career that spanned 25 years, mostly at the University of Toronto except for\r\n  four years at Osgoode Hall (1945-49). He was the author of many legal texts,\r\n  including Canadian Constitutional Law, and was associate editor of Dominion\r\n  Law Reports and Canadian Criminal Cases for 23 years. He was appointed to the\r\n  Ontario Court of Appeal in 1965 and to the Supreme Court of Canada on March\r\n  19, 1970. On December 27, 1973, he was named Chief Justice of Canada. He served\r\n  on the Supreme Court for 14 years. Chief Justice Laskin died on March 26, 1984,\r\n  at the age of 71."
    },
    {
        "Names of Judges":"The Hon. Robert George Brian Dickson",
        "Date of Appointment":"1973-03-26",
        "Date of Departure":"1984-04-18  Footnote 1",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=robert-george-brian-dickson",
        "bio":"Robert George Brian Dickson was born in Yorkton, Saskatchewan, on May 25,\r\n  1916. He was the son of Thomas Dickson and Sarah Elizabeth Gibson. After his\r\n  family moved to Winnipeg, he attended the University of Manitoba and graduated\r\n  with an LL.B. in 1938. He worked for two years in the investment department\r\n  of the Great-West Life Assurance Company, then was called to the bar in 1940.\r\n  Before practising law, he enlisted in the armed forces during the Second World\r\n  War and served overseas, where he was severely wounded in 1944. Upon his return\r\n  to Winnipeg in 1945, he joined the law firm of Aikins, Loftus, MacAulay, Turner,\r\n  Thompson & Tritschler. He also lectured at the Faculty of Law of the University\r\n  of Manitoba for six years, until 1954. In 1963 he was appointed to the Court\r\n  of Queen's Bench of Manitoba and four years later was elevated to the Manitoba\r\n  Court of Appeal. He was appointed to the Supreme Court of Canada on March 26,\r\n  1973 and became its chief justice on April 18, 1984. He served on the Supreme\r\n  Court for 17 years before retiring on June 30, 1990. Chief Justice Dickson\r\n  died on October 17, 1998, at the age of 82."
    },
    {
        "Names of Judges":"The Hon. Jean Beetz",
        "Date of Appointment":"1974-01-01",
        "Date of Departure":"1988-11-09",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=jean-beetz",
        "bio":"Jean Beetz was born in Montreal, Quebec, on March 27, 1927. He was the son \r\n  of Jean Beetz and Jeanne\r\n  Cousineau . He began his university education at the \r\n  University of Montreal, earning a B.A. in 1947 and an LL.L. in 1950. Awarded \r\n  a Rhodes Scholarship, he went to Oxford University, where he completed a further \r\n  B.A. in 1953. He was called to the bar before he left for England, and upon \r\n  his return in 1953 became an assistant professor at the University of Montreal. \r\n  One of the first full-time law professors at the university, he taught there \r\n  for 20 years and from 1968 to 1970 was dean of the faculty. During that period, \r\n  he also acted as a legal adviser to the federal government and served as special \r\n  counsel on constitutional affairs to Pierre Elliott\r\n  Trudeau , then prime minister \r\n  of Canada. He was appointed to the Quebec Court of Appeal in 1973 and elevated \r\n  to the Supreme Court of Canada on January 1, 1974. He served on the Supreme \r\n  Court for 14 years and retired on November 10, 1988. He is appointed to the \r\n  Order of Canada in 1989 for his contribution to Canadian federalism, administrative, \r\n  public, and civil law. Justice Beetz died on September 30, 1991, at the age \r\n  of 64."
    },
    {
        "Names of Judges":"The Hon. Louis-Philippe de Grandpré",
        "Date of Appointment":"1974-01-01",
        "Date of Departure":"1977-09-30",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=louis-philippe-de-grandpre",
        "bio":"Louis-Philippe de Grandpré was born in Montreal, Quebec, on February \r\n  6, 1917. He is the son of Roland de Grandpré and Aline Magnan. He received \r\n  a classical education at Collège Ste-Marie in Montreal, graduating in \r\n  1935, before attending McGill University, where he completed a B.C.L. in 1938. \r\n  He was called to the bar of Quebec that year and practised law in Montreal, \r\n  eventually founding the firm of Tansey, de Grandpré et de Grandpré . \r\n  He lectured occasionally on insurance law at McGill University from 1960 to \r\n  1963. He was also president of the bars of Montreal and Quebec in 1968 and 1969, \r\n  and president of the Canadian Bar Association from 1972 to 1973. On January \r\n  1, 1974, he was appointed to the Supreme Court of Canada. He served on the Supreme \r\n  Court for three years, resigning on October 1, 1977. Justice de Grandpré \r\n  died on January 24, 2008, at the age of 90."
    },
    {
        "Names of Judges":"The Hon. Willard Zebedee Estey",
        "Date of Appointment":"1977-09-29",
        "Date of Departure":"1988-04-21",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=willard-zebedee-estey",
        "bio":"Willard Zebedee Estey was born in Saskatoon, Saskatchewan, on October 10,\r\n  1919. He is the son of James Wilfred Estey, a Supreme Court of Canada justice,\r\n  and Muriel Baldwin. He studied at the University of Saskatchewan, obtaining\r\n  a B.A. in 1940 and an LL.B. two years later. In 1942 he was called to the bar\r\n  of Saskatchewan but served with the armed forces during the Second World War\r\n  rather than practising law. He then went to Harvard Law School and completed\r\n  an LL.M. in 1946. He taught law at the University of Saskatchewan for a year\r\n  then was called to the bar of Ontario in 1947 and joined the Toronto firm of\r\n  Robertson, Fleury & Lane, later named Robertson, Lane, Parrett & Estey.\r\n  In 1973 he was appointed to the Ontario Court of Appeal and two years later\r\n  was named Chief Justice of the High Court of Justice of Ontario. He became\r\n  Chief Justice of Ontario in 1976 and was appointed to the Supreme Court of\r\n  Canada on September 29, 1977. In 1985 he chaired the Commission of Inquiry\r\n  into the Collapse of the CCB and Northland Bank. Justice Estey served on the\r\n  Supreme Court for 10 years and retired on April 22, 1988. Justice Estey died\r\n  on January 25, 2002, at the age of 82."
    },
    {
        "Names of Judges":"The Hon. Yves Pratte",
        "Date of Appointment":"1977-10-01",
        "Date of Departure":"1979-06-29",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=yves-pratte",
        "bio":"Yves Pratte was born in Quebec City, Quebec, on March 7, 1925. He was the\r\n  son of Garon Pratte and Georgine\r\n  Rivard . After completing an LL.L. at Laval\r\n  University in 1947, he did graduate work in tax and corporate law at the University\r\n  of Toronto law school. He was called to the bar of Quebec in 1947 and practised\r\n  law in Quebec City, where he later founded the firm of Pratte,\r\n  Tremblay et Dechêne . From 1962 to 1965, he was dean of the Faculty of Law at Laval\r\n  University, and from 1965 to 1968, he served as special legal counsel to two\r\n  Quebec premiers, Jean Lesage and Daniel Johnson. He was also a member of the\r\n  Royal Commission on Security from 1966 to 1968, the year he was named chairman\r\n  of Air Canada, a position he held for seven years. On October 1, 1977, he was\r\n  appointed to the Supreme Court of Canada. He served on the Court for one year,\r\n  resigning on June 30, 1979. Justice Pratte died on June 26, 1988, at the age\r\n  of 63."
    },
    {
        "Names of Judges":"The Hon. William Rogers McIntyre",
        "Date of Appointment":"1979-01-01",
        "Date of Departure":"1989-02-14",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=william-rogers-mcintyre",
        "bio":"William Rogers McIntyre was born in Lachine ,\r\n  Quebec, on March 15, 1918. He is the son of Charles Sidney McIntyre and Pauline\r\n  May Sifton. When he was young, his family moved to Moose Jaw, Saskatchewan.\r\n  He studied at King George Public School and the Central Collegiate Institute\r\n  in Moose Jaw before attending the University of Saskatchewan, from which he\r\n  graduated with a B.A. in 1939. He enlisted in the armed forces two years later\r\n  and served overseas in the Second World War. In 1946 he returned to Canada\r\n  and completed an LL.B. at the University of Saskatchewan. Called to the bars\r\n  of Saskatchewan and British Columbia the following year, he settled in Victoria\r\n  and joined the law firm of Whittaker & McIllree.\r\n  He was appointed to the Supreme Court of British Columbia in 1967 and elevated\r\n  to the British Columbia Court of Appeal six years later. On January 1, 1979,\r\n  he was appointed to the Supreme Court of Canada. He served on\r\n  the Supreme Court for 10 years and retired on February 15, 1989. Justice McIntyre\r\n  died on June 14, 2009, at the age of 91."
    },
    {
        "Names of Judges":"The Hon. Julien Chouinard",
        "Date of Appointment":"1979-09-24",
        "Date of Departure":"1987-02-06",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=julien-chouinard",
        "bio":"Born in Quebec City, Quebec, on February 4, 1929. Son of Joseph Julien\r\n    Chouinard and Berthe Cloutier . Married to Jeannine Pettigrew in 1956. Three children: Julien , Lucie and Nicole. Educated at Laval University, B.A., 1948, and LL.L., \r\n  1951. Awarded a Rhodes Scholarship, he pursued his studies at Oxford University \r\n  and graduated with a Master's degree in 1953. Called to the Bar,1953, and practised \r\n  law in Quebec City with Prévost, Gagné , Flynn, Chouinard\r\n  et Jacques , \r\n  1953-65. Taught corporate law at Laval University, 1959-66, where he was responsible \r\n  for the 4th year of the law program, 1964-66, and a member of the faculty council, \r\n  1966-68. President of the Jeune Barreau du Québec , 1961-62, and member \r\n  of the Quebec regional council and of the National Council of the Canadian Bar \r\n  Association, 1965-69. Represented Quebec on the National Council on the Administration \r\n  of Justice and at the Conference of Commissioners on Uniformity of Legislation \r\n  in Canada, 1965-68. Served as Lieutenant Colonel in the Militia, Commander of \r\n  the 6th Field Artillery Regiment, 1965-68. Appointed Q.C., 1965, served as Deputy \r\n  Minister of Justice of Quebec, 1965-68, and three years later became Secretary \r\n  General of the Conseil exécutif du Québec (Executive Council of \r\n  Quebec), the highest-ranking public servant in the provincial government, 1968-75. \r\n  Received the Centennial medal, 1967, and the Vanier medal of the Institute of \r\n  Public Administration of Canada, 1972. Named Officer of the Order of Canada, \r\n  1974. Appointed to the Quebec Court of Appeal, 1975, and chaired the Commission \r\n  of Inquiry into Bilingual Air Traffic Control Services in Quebec, 1976-79. Appointed \r\n  to the Supreme Court of Canada, September 24, 1979, and served on the Court \r\n  for seven years. Justice Chouinard died on February 6, 1987, at the age of 58."
    },
    {
        "Names of Judges":"The Hon. Antonio Lamer",
        "Date of Appointment":"1980-03-28",
        "Date of Departure":"1990-07-01  Footnote 1",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=antonio-lamer",
        "bio":"The Right Honourable Antonio Lamer , B.A., LL.L., LL.D., University of Montréal; \r\n  LL.D., University of Moncton; D.U., University of Ottawa; LL.D., University \r\n  of Toronto; LL.D., University of New Brunswick; LL.D., University of Dalhousie. \r\n  Born in Montréal, July 8, 1933; son of Antonio Lamer, Q.C., and Florence \r\n  Storey. Married to Danièle Tremblay , 1987; one child: Stéphane ; two stepchildren: Mélanie and Jean-Frédéric . Educated at Collège de Saint-Laurent and University of Montréal (LL.L.). Called \r\n  to the Bar of Quebec, 1957. Practised law, particularly with Mr. Philip Cutler \r\n  and Mr. Jacques Bellemare, Q.C. Associate Professor, Faculty of Law, University \r\n  of Montréal, and Lecturer in criminology. Founder of the Defence Attorneys' \r\n  Association of Quebec. National Chairman of the Criminal Justice Section of \r\n  the Canadian Bar Association. Appointed to the Superior Court, December 19, \r\n  1969. Elected Chairman of the Quebec Society of Criminology and member of the \r\n  Board of Directors of the Canadian Human Rights Foundation in June 1974. Appointed \r\n  Vice-Chairman of the Law Reform Commission of Canada in 1971 and Chairman thereof \r\n  in April 1976. Appointed to the Quebec Court of Appeal, March 17, 1978 and to \r\n  the Supreme Court of Canada, March 28, 1980. Appointed Chief Justice of Canada, \r\n  July 1, 1990. Chairman, Canadian Judicial Council. Chairman, Advisory Council \r\n  of the Order of Canada. Chairman, Board of Governors of the National Judicial \r\n  Institute. Member of the Privy Council of Canada. Honorary Bencher, Lincoln's \r\n  Inn, London, 1990. Order of Merit, University of Montréal, 1991. Knight \r\n  of Justice, Order of St. John, 1993. Honorary Colonel of the Governor General's \r\n  Foot Guards. He retired on January 7, 2000. Chief Justice Lamer died on November \r\n  24, 2007, at the age of 74."
    },
    {
        "Names of Judges":"The Hon. Bertha Wilson",
        "Date of Appointment":"1982-03-04",
        "Date of Departure":"1991-01-03",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=bertha-wilson",
        "bio":"Bertha Wilson was born in Kirkcaldy, Scotland, on September 18, 1923. She is \r\n  the daughter of Archibald Wernham and Christina Noble. She attended the University \r\n  of Aberdeen, Scotland, and graduated with an M.A. in 1944. She continued her \r\n  education at the Training College for Teachers in Aberdeen, obtaining her diploma \r\n  in 1945. She married the Reverend John Wilson in December 1945 and they emigrated \r\n  to Canada in 1949. In 1955 she enrolled at Dalhousie University to study law, \r\n  and three years later she completed her LL.B. and was called to the bar of Nova \r\n  Scotia. In 1959 she was called to the bar of Ontario and practised law in Toronto \r\n  with Osler, Hoskin & Harcourt for 16 years. She was appointed to the Ontario \r\n  Court of Appeal in 1975 and to the Supreme Court of Canada on March 4, 1982. \r\n  She was also appointed to the Permanent Court of Arbitration in 1984. She served \r\n  on the Supreme Court for eight years and retired on January 4, 1991. Justice \r\n  Wilson died on April 28, 2007, at the age of 83."
    },
    {
        "Names of Judges":"The Hon. Gerald Eric Le Dain",
        "Date of Appointment":"1984-05-29",
        "Date of Departure":"1988-11-29",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=gerald-eric-le-dain",
        "bio":"Gerald Eric Le Dain was born in Montreal, Quebec, on November 27, 1924. He \r\n  is the son of Eric George Bryant Le Dain and Antoinette\r\n  Louise Whithard. In \r\n  1943 he went overseas with the armed forces to serve in the Second World War. \r\n  After returning to Canada in 1946, he enrolled at McGill University and obtained \r\n  a B.C.L. degree in 1949. That year, he was called to the bar of Quebec. He pursued \r\n  his studies in France, at the University of Lyon, and became a Docteur\r\n  de l'Université in 1950. He first practised law with Walker, Martineau, Chauvin, Walker & \r\n  Allison in Montreal. From 1953 to 1959, and in 1966 and 1967, he taught law \r\n  at McGill University. He became dean of Osgoode Hall Law School in 1967 and \r\n  was called to the bar of Ontario the following year. From 1969 to 1973, he chaired \r\n  the Commission of Inquiry into the Non-Medical Use of Drugs. Two years later, \r\n  he was appointed to the Federal Court of Appeal and the Court Martial Appeal \r\n  Court. He was elevated to the Supreme Court of Canada on May 29, 1984. Justice Le Dain served on the Supreme Court for four years and retired on November 30, \r\n  1988. Justice Le Dain died on December 18, 2007, at the age of 83."
    },
    {
        "Names of Judges":"The Hon. Gérard Vincent La Forest",
        "Date of Appointment":"1985-01-16",
        "Date of Departure":"1997-09-29",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=gerard-vincent-la-forest",
        "bio":"Gérard Vincent La Forest was born in Grand Falls, New Brunswick, on\r\n  April 1, 1926. He is the son of J. Alfred La\r\n  Forest and Philomène Lajoie .\r\n  After studying at St. Francis Xavier University, he studied law at the University\r\n  of New Brunswick. In 1949 he obtained a B.C.L. and was called to the bar of\r\n  New Brunswick. Awarded a Rhodes Scholarship, he continued his studies at Oxford\r\n  University, earning a B.A. in 1951. He also completed an LL.M. in 1965 and\r\n  a J.S.D. in 1966, both at Yale University. Following a short period in private\r\n  practice, he served in the federal Department of Justice from 1952 to 1955\r\n  and then as a legal advisor for a private corporation before embarking on a\r\n  teaching career. From 1956 to 1968, he taught at the University of New Brunswick,\r\n  and from 1968 to 1970 he was Dean of Law at the University of Alberta. He returned\r\n  to government in 1970, serving as Assistant Deputy Attorney General of Canada\r\n  until 1974. He then became a member of the Law Reform Commission of Canada\r\n  for five years. In 1981, after teaching for two years at the University of\r\n  Ottawa, he was appointed to the New Brunswick Court of Appeal. On January 16,\r\n  1985, he was appointed to the Supreme Court of Canada. Justice La\r\n  Forest served\r\n  on the Supreme Court for 12 years and retired on September 30, 1997."
    },
    {
        "Names of Judges":"The Hon. Claire L'Heureux-Dubé",
        "Date of Appointment":"1987-04-15",
        "Date of Departure":"2002-06-30",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=claire-lheureux-dube",
        "bio":"Madam Justice L'Heureux-Dubé ,\r\n  B.A., LL.L. Born in Quebec City in 1927.  Educated at Monastère des\r\n  Ursulines , Rimouski, Collège Notre-Dame \r\n  de Bellevue , Québec, University Laval Law Faculty, LL.L. (cum laude),\r\n   1951. Called to the Quebec Bar, 1952. Hon. LL.D., Dalhousie University, 1981;\r\n   University of Montréal, 1983; Laval University, 1984; University of\r\n   Ottawa,  1988; Université du Québec à Rimousk i, 1989;\r\n   University  of Toronto, 1994; Queen's University, 1995; Gonzaga University,\r\n   1996; Windsor  University, 2000; York University, 2001; Concordia University,\r\n   2001; Law Society  of Upper Canada, 2002. Married to Dr. Arthur Dubé ,\r\n   D. Sc. (deceased 1978).  Two children: Louise, lawyer, and Pierre, deceased.\r\n   Law practice Bard, L'Heureux \r\n  & Philippon in 1969, L'Heureux, Philippon,\r\n  Garneau, Tourigny, St-Arnaud & Associates, 1952-1973. Q.C., Sept. 1969. Lecturer in Family Law, Cours\r\n   de formation professionnelle du Barreau du Québec , 1970-1973. Royal\r\n   Commission  of Inquiries into certain matters relating to the Department of\r\n   Manpower and  Immigration, 1973-1976. Counsellor of the Quebec Bar, 1968-1970.\r\n   Delegate at  the General Council of the Quebec Bar, 1968-1970. Member of the Conseil consultatif  de l'administration de\r\n   la justice de la Province de Québec ,\r\n   1967-1973.  Vice-president of the Canadian Consumers Council, 1970-1973. President\r\n   of Family  Law Committee and Family Court Committee of the Quebec Civil Code\r\n   Revision Office,  1972-1976. Vice-president of The Vanier Institute of the\r\n   Family, 1972-1973.  Member of the Canadian Bar Association. Member of the\r\n   Canadian Institute for  the Administration of Justice. President of the International\r\n   Commission of  Jurists (Canadian Section), 1981-1983; Vice-President (Innatl.\r\n   Bd I.C.J.), 1992-1998.  Member of the Board of Directors of the International\r\n   Society on Family Law,  1977, and Vice-president, 1982-1988. Member of the\r\n   National Council of the Canadian  Human Rights Foundation, 1980-1984. Member\r\n   of Quebec Association of comparative  law (President 1984-90). Chairman Editorial\r\n   Board, The Canadian Bar Review,  1985. Associate member of International Academia\r\n   of comparative law, 1992. Medal  of the Alumni, University Laval, 1986. Medals\r\n   from Quebec Bar, 1987, Montreal  Bar, 1994, Bar of Quebec, 1995. Medal International\r\n   Year of the Family (Quebec),  1994. Member of several associations and author\r\n   of numerous articles. Appointed  to the Superior Court of Quebec, February\r\n   1973, Quebec Court of Appeal, October  1979 and Supreme Court of Canada, April\r\n   15, 1987. Honorary Lt. Colonel Helicopter  Squadron 430, 1994 (retired: 1996).\r\n   Honorary Member of the American College  of Trial Lawyers, 1995. Member of\r\n   the American Law Institute, 1995. Recipient  of \"The Canadian Award\" from\r\n   Canadian Hadassah-WIZO, 1996. Recipient  of \" Prix\r\n   de la Justice 1997 \" from\r\n   the Canadian Institute for the Administration  of Justice. Recipient of Margaret\r\n   Brent Women Lawyers of Achievement Award from  the American Bar Association\r\n   Commission on Women in the Profession, 1998-2002.  Recipient of \"The Yves Pélicier Award\" presented by the International \r\n  Academy of Law and Mental Health, 2002. Appointed Companion of the Order of\r\n    Canada on May 8, 2003. President, International Commission of Jurists, Geneva,\r\n    1998. Justice L'Heureux-Dubé retired on July 1, 2002."
    },
    {
        "Names of Judges":"The Hon. John Sopinka",
        "Date of Appointment":"1988-05-24",
        "Date of Departure":"1997-11-24",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=john-sopinka",
        "bio":"John Sopinka was born in Broderick, Saskatchewan, on March 19, 1933. He was\r\n  the son of Metro Sopinka and Nancy Kikcio. In 1941 his family moved to Hamilton,\r\n  Ontario. He studied at the University of Toronto, earning a B.A. in 1955 and\r\n  an LL.B. three years later. From 1955 to 1958, while working on his law degree,\r\n  he played professional football with the Toronto Argonauts and Montreal Alouettes\r\n  of the Canadian Football League. He was called to the bar of Ontario in 1960,\r\n  and was later called to the bars of four other provinces and two territories.\r\n  He practised law in Toronto for 28 years, first with Fasken & Calvin and\r\n  then with Stikeman, Elliott. During that time, he also lectured on law at both\r\n  Osgoode Hall Law School and the University of Toronto. He is the author of\r\n  several legal works, including The Trial of an Action, and co-author of The\r\n  Law of Evidence in Canada. Appointed to the Supreme Court of Canada on May\r\n  24, 1988, he served on the Court for nine years. Justice Sopinka died on November\r\n  24, 1997, at the age of 64."
    },
    {
        "Names of Judges":"The Hon. Charles Doherty Gonthier",
        "Date of Appointment":"1989-02-01",
        "Date of Departure":"2003-07-31",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=charles-doherty-gonthier",
        "bio":"Mr. Justice Gonthier , B.A., B.C.L. Born in Montréal, Quebec, August \r\n  1, 1928. Son of Georges Gonthier and Kathleen Doherty. Educated at École \r\n  Garneau , Ottawa; Collège Stanislas , Montréal (baccalauréat \r\n  Paris); B.C.L., McGill University, 1951 (first class honours); Hon. LL.D., McGill \r\n  University, 1990. D.H.C., Université de Montréal , 2002. DU, Ottawa \r\n  University, 2003. Married in 1961 to Mariette\r\n  Morin , M.D., M.Sc., F.R.C.S.(C), \r\n  F.A.C.O.G. Children: Georges, François, Pierre, Jean-Charles and Yves. \r\n  Called to the Bar of Quebec, 1952. Practised law in Montréal with Hackett, \r\n  Mulvena & Laverty, 1952-57; with Hugessen, Macklaier, Chisholm, Smith & \r\n  Davis, later known as Laing, Weldon, Courtois, Clarkson, Parsons, Gonthier & \r\n  Tétrault , 1957-74. Appointed Q.C., 1971. Member of the Board of the Montréal \r\n  Legal Aid Bureau, 1959-69. President of Junior Bar of Montréal, 1960-61. \r\n  President of Junior Bar Section of the Canadian Bar Association, 1961-62. Member \r\n  of the Board of Montréal Bar, 1961-62. Secretary of the Quebec Division \r\n  of the Canadian Bar Association, 1963-64. Member of the Committee on Building \r\n  Contracts of the Quebec Civil Code Revision Office, 1969-72. Member of the Committee \r\n  on Discipline of the Bar of Quebec, 1973-74. President of the Canadian Institute \r\n  for the Administration of Justice, 1986-87. President of the Canadian Judges \r\n  Conference, 1988-89. Chairman of the Commission for National Judges of the First \r\n  World Conference on the Independence of Justice in Montréal, 1983. President \r\n  of l' Association des anciens du Collège Stanislas , 1954-55. Secretary \r\n  of the Montréal Branch of the Canadian Institute of International Affairs, \r\n  1957-58. Chairman of the Board of Collège Stanislas, 1984-90. Honorary \r\n  Secretary of the Montréal Museum of Fine Arts, 1961-76. Member of the \r\n  Board of Directors of the McCord Museum of Canadian History, 1976-89. Knight \r\n  of l 'Ordre des palmes académiques - France, 1988. Fellow, American College \r\n  of Trial Lawyers (hon.), 1996. Fellow, Canadian Bar Association, 2003. Lifetime \r\n  member, Canadian Institute for the Administration of Justice. Bar of Montreal \r\n  Medal, 2003. Appointed to the Quebec Superior Court on October 17, 1974, to \r\n  the Quebec Court of Appeal on May 24, 1988 and to the Supreme Court of Canada \r\n  on February 1, 1989. Justice Gonthier retired from the Court on August 1, 2003, \r\n  and was counsel in the firm McCarthy Tétrault (Montreal). He was Chairman \r\n  of the Board of Governors of the Centre for International Sustainable Development \r\n  Law at the Law Faculty of McGill University of which he was Wainwright Senior \r\n  Research Fellow. He was appointed Commissioner of the Communications Security \r\n  Establishment (CSE), Canada's national cryptologic agency, effective August \r\n  1, 2006. He was appointed Companion of the Order of Canada (C.C.) on May 3, 2007. Justice Gonthier died on July 17, 2009, at the age of 80."
    },
    {
        "Names of Judges":"The Hon. Peter deCarteret Cory",
        "Date of Appointment":"1989-02-01",
        "Date of Departure":"1999-05-31",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=peter-decarteret-cory",
        "bio":"Mr. Justice Cory, B.A., LL.L. Born in Windsor, Ontario, October 25, 1925.\r\n  Son of Andrew and Mildred (Beresford Howe) Cory. Widower of Edith Nash. Three children: Christopher, Andrew,\r\n  Robert.  Educated at the University\r\n  of Western Ontario (Assumption), B.A., 1947, Osgoode Hall Law School, 1950.\r\n  Pilot in the RCAF. Served overseas with 6th Bomber Group. Called to the Ontario\r\n  Bar, 1950. Appointed Q.C., 1963. Practiced law with Holden, Murdoch. Elected\r\n  Bencher of the Law Society of Upper Canada, 1971. Past Chairman of the Ontario\r\n  Civil Liberties Section of the Canadian Bar Association. Past President of\r\n  the County of York Law Association. Past National Director of the Canadian\r\n  Bar Association. Past President of the Advocates' Society. Appointed to the\r\n  Supreme Court of Ontario High Court, 1974. Appointed to the Ontario Court of\r\n  Appeal, 1981. Appointed to the Supreme Court of Canada, February 1, 1989. Hon.\r\n  Colonel, 426 (T) Training Squadron. Justice Cory retired on June 1, 1999. Justice Cory died  on April 7, 2020, at the age of 94."
    },
    {
        "Names of Judges":"The Hon. Beverley McLachlin",
        "Date of Appointment":"1989-03-30",
        "Date of Departure":"2000-01-07  Footnote 1",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=beverley-mclachlin",
        "bio":"The Right Honourable Beverley McLachlin spent her formative years in Pincher Creek, Alberta and was educated at the University of Alberta, where she received a B.A. (Honours) in Philosophy in 1965. She pursued her studies at the University of Alberta and, in 1968, received both an M.A. in Philosophy and an LL.B. She was called to the Alberta Bar in 1969 and to the British Columbia Bar in 1971 and practised law in Alberta and British Columbia.  Commencing in 1974, she taught for seven years in the Faculty of Law at the University of British Columbia as a tenured Associate Professor. Her judicial career began in April 1981 when she was appointed to the Vancouver County Court. In September 1981, she was appointed to the Supreme Court of British Columbia. She was elevated to the British Columbia Court of Appeal in December 1985 and was appointed Chief Justice of the Supreme Court of British Columbia in September 1988.  Seven months later, in April 1989, she was sworn in as a Justice of the Supreme Court of Canada. On January 7, 2000, she was appointed Chief Justice of Canada. She is the first woman in Canada to hold this position. In addition to her judicial duties at the Supreme Court, the Right Honourable Beverley McLachlin   chaired the Canadian Judicial Council, the Advisory Council of the Order of Canada and the Board of Governors of the National Judicial Institute. She  is the author of numerous articles and publications. She retired on December 15, 2017. The Right Honourable Beverley McLachlin bids farewell to the Supreme Court The Right Honourable Beverley McLachlin bids farewell to the Supreme Court ."
    },
    {
        "Names of Judges":"The Hon. William Stevenson",
        "Date of Appointment":"1990-09-17",
        "Date of Departure":"1992-06-04",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=william-stevenson",
        "bio":"William Stevenson was born in Edmonton, Alberta, on May 7, 1934.\r\n          He is the son of Alexander Lindsay Stevenson and Eileen Harriet Burns.\r\n          He studied at the University of Alberta, obtaining a B.A. in 1956 and\r\n          an LL.B. the following year. Called to the bar in 1958, he joined the\r\n          law firm of Morrow, Morrow & Reynolds in Edmonton. In 1959 he was\r\n          counsel on the last case from Canada to be appealed to the Judicial\r\n          Committee of the Privy Council in London, England. He became a lecturer\r\n          at the University of Alberta in 1963 and a full-time professor of law\r\n          five years later. In 1970 he returned to private practice but continued\r\n          to lecture on law. He is the author of many legal texts and a founding\r\n          editor of the Alberta Law Review. He was appointed to the District\r\n          Court of Alberta in 1975 and to the Court of Queen's Bench of Alberta\r\n          in 1979. A year later, he was appointed to the Alberta Court of Appeal,\r\n          and on September 17, 1990, he was elevated to the Supreme Court of\r\n          Canada. Justice Stevenson served on the Supreme Court for nearly two\r\n          years before retiring on June 5, 1992. Justice Stevenson died on July 7, 2021, at the age of 87."
    },
    {
        "Names of Judges":"The Hon. Frank Iacobucci",
        "Date of Appointment":"1991-01-07",
        "Date of Departure":"2004-06-30",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=frank-iacobucci",
        "bio":"Mr. Justice Iacobucci, B.Com., LL.B., LL.M., Dip. Int'l L., LL.D., L.S.M.\r\n  Born  in Vancouver, B.C., June 29, 1937; son of Gabriel and Rosina (Pirillo)\r\n  Iacobucci. \r\n  Married October 31, 1964 to Nancy Eastham, B.A., LL.B., Dip. Int'l L. Children:\r\n   Andrew, Edward and Catherine. Educated at Britannia High School, Vancouver,\r\n  \r\n  B.C.; University of British Columbia; St. John's College, Cambridge University.\r\n   Honorary Doctorates from University of British Columbia, 1989; University\r\n  of \r\n  Toronto, 1989; University of Ottawa, 1995; University of Victoria, 1996; Law\r\n   Society of Upper Canada, 2000; McGill University, 2003; University of Waterloo,\r\n  \r\n  2003; Università della Calabria (Cosenza Italy), 2003. Called to the\r\n   Bar of Ontario, 1970; appointed Q.C. (Federal), 1986; recipient of the Law\r\n  Society \r\n  Medal (Ontario), 1987. Associate, Dewey, Ballantine, Bushby, Palmer & Wood,\r\n   New York, N.Y., 1964-67; Associate Professor and Professor, Faculty of Law,\r\n  \r\n  University of Toronto, 1967-85; Associate Dean, Faculty of Law, University\r\n  of  Toronto, 1973-75; Vice-President, Internal Affairs, University of Toronto,\r\n  1975-78; \r\n  Visiting Fellow, Wolfson College, Cambridge University, 1978; Dean, Faculty\r\n   of Law, University of Toronto, 1979-83; Vice President and Provost, University\r\n  \r\n  of Toronto, 1983-85; Deputy Minister of Justice and Deputy Attorney General\r\n   for Canada, 1985-88. Numerous publications; consultant to federal and provincial\r\n  \r\n  governments. Member, Ontario Securities Commission, 1982-85; Director, Multicultural\r\n   History Society of Ontario, 1976-88; Member, Board of Directors, National\r\n  Congress \r\n  of Italian Canadians, Toronto District, 1979-83; Vice President, National Congress\r\n   of Italian Canadians, 1980-83; Vice President and Member, Board of Governors,\r\n  \r\n  Canadian Institute for Advanced Legal Studies, 1981-85, 1991-1998; Director,\r\n   Cambridge Canadian Trust, 1984-91; Member, Canadian Judicial Council and Education\r\n  \r\n  Committee, 1988-91, Executive Committee, 1990-91; Member, Advisory Council,\r\n   International Center for Criminal Law Reform and Criminal Justice Policy,\r\n  1991-93, \r\n  Director, 1993-present; Member, Advisory Board, Institute of Canadian Studies,\r\n   University of Ottawa, 1998-present; Member, Advisory Committee, Faculty of\r\n  Law, \r\n  McGill University, 1996-present; Governor, Canadian Judicial Centre \/ National\r\n   Judicial Institute, 1989-present. Former Elder, Islington United Church. Italo-Canadian\r\n  \r\n  of the Year Award, Confratellanza Italo-Canadese (Vancouver), 1985; Man of\r\n  the  Year Award, Canadian-Italian Business and Professional Association of\r\n  Toronto, \r\n  1985; Distinguished Fiji Award, The Fraternity of Phi Gamma Delta, 1987. Ordine\r\n   al Merito Award, National Congress of Italian Canadians (Toronto), 1989; 125th\r\n  \r\n  Anniversary of the Confederation of Canada Medal, 1992; Commendatore dell'Ordine\r\n   Al Merito della Repubblica Italiana, 1993; Lion d'Or Award, Ordre des\r\n    Fils d'Italie au Canada (Montréal), 1995; Cosentino dell'Anno\r\n     Award, Federation of Clubs Cosentini of Ontario, 1995; Man of the Year Award,\r\n    \r\n  Brotherhood Interfaith Society (Vancouver), 1999; Medaglia d'Argento del Presidente\r\n     della Repubblica Italiana, 2000; Canadian-Italian National Award, 2000;\r\n    Premio \r\n  Italia nel Mondo\/Italy in the World Award, 2001; Valigia d'Oro Award, 2002;\r\n     Honorary Citizenship, Mangone (Cosenza), Italy, 1996, and Cepegatti (Pescara),\r\n    \r\n  Italy, 2001. Honorary Fellow, St. John's College, Cambridge University,\r\n  1999; Honorary Fellow, American College of Trial Lawyers, 1999. Appointed Chief\r\n  Justice of the Federal Court of Canada, September 2, 1988. Appointed to Court\r\n  Martial Appeal Court, June 29, 1989. Appointed to the Supreme Court of Canada,\r\n  January 7, 1991. Appointed to the Permanent Court of Arbitration, 1997. Justice\r\n  Iacobucci  retired on July 1, 2004."
    },
    {
        "Names of Judges":"The Hon. John C. Major",
        "Date of Appointment":"1992-11-13",
        "Date of Departure":"2005-12-24",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=john-c-major",
        "bio":"Mr. Justice Major, B.Com., LL.B. Born in Mattawa, Ontario, 1931. Son of William \r\n  and Elsie Major. Married to Hélène Provencher , 1959. Children: \r\n  Suzan, Peter, Paul and Steven. Educated at Loyola College (now Concordia University), \r\n  Montréal, and University of Toronto. Hon. LL.D.: Concordia University, \r\n  2003; University of Calgary, 2005; University of Toronto, 2005. Called to the \r\n  Alberta Bar, 1958. Practised law with Bennett, Jones, Verchere at Calgary and \r\n  became senior partner in 1967. Appointed Q.C., 1972. Elected Fellow of the American \r\n  College of Trial Lawyers, 1980. Counsel for the Canadian Medical Protective \r\n  Association (Alberta), 1971-91. Senior Counsel for the City of Calgary Police \r\n  Service, 1975-85; Counsel at the McDonald Commission re RCMP, 1978-82; Counsel, \r\n  Royal Commission into the collapse of the CCB and Northland Bank (Estey Commission); \r\n  Senior Counsel for the Province of Alberta at the Code Inquiry into the collapse \r\n  of the Principal Group of Companies, 1987. Appointed to the Alberta Court of \r\n  Appeal, July 11, 1991. Appointed to the Supreme Court of Canada, November 13, \r\n  1992. Justice Major retired on December 25, 2005."
    },
    {
        "Names of Judges":"The Hon. Michel Bastarache",
        "Date of Appointment":"1997-09-30",
        "Date of Departure":"2008-06-30",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=michel-bastarache",
        "bio":"Mr. Justice Bastarache , B.A., LL.L., LL.B., D.E.S. Born June 10, 1947. Son\r\n   of Dr. Alfred Bastarache and Madeleine\r\n   Claveau . Educated at University of\r\n  Moncton  (B.A.), University of Montréal (LL.L.), University of Ottawa\r\n  (LL.B.)  and University of Nice (graduate degree in public law). Honorary degrees,\r\n  University  of Moncton, 1998, Dalhousie University, 1998; Ottawa University,\r\n  1998; University  of Mount Allison, 2001; University of Manitoba, 2005; Université\r\n  Sainte-Anne , 2006; University of New Brunswick, 2007; honorary doctorate, University\r\n  of Montréal, 2008.  Married Yolande Martin\r\n  in 1968. Two children: Émilie and Jean-François ,\r\n  deceased. Called  to the New Brunswick Bar, 1980, the Alberta Bar, 1985, and\r\n  the Ontario Bar,  1986. Legal translator in the New Brunswick government, Vice-President\r\n  and Director  of Marketing at Assumption Life, later President and Chief Executive\r\n  Officer  of Assumption Life and its subsidiaries. Law professor and Dean at\r\n  the University  of Moncton Law School, 1978-83. Director General, Promotion\r\n  of Official Languages,  Department of the Secretary of State of Canada, 1983-84.\r\n  Associate Dean, Common  Law Section, Faculty of Law, University of Ottawa,\r\n  1984-87. Practised law in  Ottawa with Lang, Michener, Lash, Johnston, 1987-89,\r\n  and in Moncton with Stewart,  McKelvey, Stirling, Scales, 1994-95. Editor and\r\n  principal author of three books: Language Rights in Canada ( Yvon Blais , 1987 and 2004 (2nd ed.)), Précis\r\n   du droit des biens réels ( Yvon\r\n   Blais , 1993 and 2001 (2nd ed.))\r\n   and The Law of Bilingual Interpretation (Butterworths, 2008). Numerous publications\r\n   in collective works and periodicals. Jurist of the year, Association\r\n   des juristes francophones du Nouveau-Brunswick , 1993. Ordre\r\n   des francophones d'Amérique ,\r\n   government of Quebec, 1981. Awarded Canadian 125th anniversary medal, 1993. Prix Boréal,\r\n   Fédération\r\n   des communautés \r\n  francophones et acadiennes du Canada , 1995. Kavanagh Award, University of Ottawa,\r\n    1998. Received the Médaille de Commandeur de l'Ordre de la Pléiade ,\r\n     1999, Goodman Fellow, University of Toronto, 1999. Fellow, American College\r\n     of Trial Lawyers, 2001. Received the medal marking the 125th anniversary\r\n    of  the University of Montréal's Faculty of Law, 2003. Officier\r\n    de la Légion \r\n  d'honneur (France) , 2003. Member, Common Law Honour Society, University of\r\n    Ottawa,  since 2003. Member of the Board of Directors of Air Nova, Fundy\r\n    Cable, Corporate  Communications and Paturel Seafood, 1993-95. Member of\r\n    the Editorial Boards  of the R evue générale de droit international ,\r\n    the R evue \r\n  québécoise de droit international , the Revue\r\n  générale\r\n   de droit , the review C'est\r\n   ton droit and the Revue du\r\n    Nouvel Ontario , 1985-88. Editor-in-Chief of the Canadian Bar Review ,\r\n     since 1998-2005. Vice-Chair, National Judicial Institute,  2004-2008; Member\r\n     of the Canadian National Group to the Permanent Court of Arbitration, since\r\n     2005; Member of numerous committees on legal education and the practice\r\n    of law.  Member of the Atlantic Provinces Economic Council, 1992-94, Literacy\r\n    New Brunswick,  1993-94, the Izaak Walton Killam Hospital for Children Foundation\r\n    (Halifax),  1994-95, and the Advisory Committees of the administration faculties\r\n    at the  University of Moncton and the University of New Brunswick at Saint\r\n    John, 1994-95.  Appointed to the New Brunswick Court of Appeal, March 1,\r\n    1995, and to the Supreme  Court of Canada, September 30, 1997. Justice Bastarache retired on July 1, 2008."
    },
    {
        "Names of Judges":"The Hon. William Ian Corneil Binnie",
        "Date of Appointment":"1998-01-08",
        "Date of Departure":"2011-10-20",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=william-ian-corneil-binnie",
        "bio":"Born in Montreal, Quebec, on April 14, 1939, William Ian Corneil Binnie is the son of James Corneil and Phyllis (Mackenzie) Binnie.  He married Susan Strickland on May 28, 1965. The couple have four children: Daniel, Matthew, Alexandra and Max.  Ian Binnie received a B.A. from McGill University in 1960, an LL.B. from Cambridge University in 1963, and an LL.M. in 1988. He was the first Canadian to be elected President of the Cambridge Union Society.  He obtained an LL.B. from the University of Toronto in 1965. In 2001, he received honorary doctorates of law from the Law Society of Upper Canada and McGill University Justice Binnie was called to the English Bar in 1966, the Ontario Bar in 1967 and the Yukon Territory Bar in 1986.  He was admitted to practice before the International Court of Justice in 1984 and obtained occasional calls to the Bars of British Columbia, Alberta, Saskatchewan, Manitoba and Newfoundland. He practised litigation at Wright & McTaggart and its successor firms\r\n  until 1982, during which time he acted as legal counsel to the Government of\r\n  Tanzania from 1970 to 1971. From 1982 to 1986, he was Associate Deputy Minister\r\n  of Justice for Canada, and he was among counsel representing Canada before the International Court\r\n  of Justice against the United States in the Gulf of Maine dispute in 1984.\r\n  From 1986 to 1998, he was a senior partner at McCarthy Tétrault. In\r\n  1990, he acted as Special Parliamentary Counsel to the Joint Committee of the\r\n  Senate and the House of Commons on the Meech Lake Accord, and in 1991, he was again a member of Canada's legal team before an international tribunal, against France, in the Saint-Pierre & Miquelon maritime\r\n  boundary dispute. He appeared as counsel before the Supreme Court of Canada\r\n  in many leading constitutional, civil and, occasionally, criminal cases. He\r\n  also served as an advisor to the Government of Newfoundland on constitutional\r\n  amendments to the Terms of Union, and as a part-time lecturer on aboriginal\r\n  rights at Osgoode Hall Law School from 1975 to 1979, in addition to serving\r\n  as a lecturer for the Law Society of Upper Canada, the Canadian Bar Association,\r\n  The Advocates' Society and other professional associations. He was elected\r\n  a Commissioner of the International Commission of Jurists in April 2003 and\r\n  also chaired the Rhodes Scholarship Selection Committee from 1999 to 2004.\r\n  He has authored numerous publications. In 1993, he was elected a Fellow of\r\n  the American College of Trial Lawyers. He is a member of the Middle Temple\r\n  Inns of Court (England) and an honorary member of the Commercial Bar Association\r\n  (U.K.) and was Honorary Colonel of 426 Squadron, 8 Wing (Trenton) from 2004\r\n  to 2007. Justice Binnie was appointed Queen’s Counsel (Ontario) in 1979.  He was appointed to the Supreme Court of Canada on January 8, 1998. Justice Binnie retired on October 21, 2011."
    },
    {
        "Names of Judges":"The Hon. Louise Arbour",
        "Date of Appointment":"1999-09-15",
        "Date of Departure":"2004-06-30",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=louise-arbour",
        "bio":"Madam Justice Arbour , B.A., LL.L. Born in Montréal, Quebec on February \r\n  10, 1947. Three children: Emilie, Patrick and Catherine Taman. Studied at the \r\n  Collège Régina Assumpta in Montréal, B.A., 1967; and at \r\n  the Faculté de droit of the Université de Montréal , LL.L., \r\n  1970 (with distinction); Hon. LL.D., York University, 1995; D.U., University \r\n  of Ottawa, 1997; Hon. LL.D., Law Society of Upper Canada, 1999; Hon. LL.D., \r\n  University of New Brunswick, 1999; Hon. LL.D., Laurentian University, 1999; \r\n  Hon. LL.D., Université du Québec à Montréal , 1999. \r\n  Hon. LL.D., Université Libre de Bruxelles, 2000; Hon. LL.D., University \r\n  of Victoria, 2000; Hon. LL.D., Kingston Royal Military College, 2000; Hon. LL.D., \r\n  Chicago-Kent College of Law, 2000; Hon. LL.D., Université de Montréal , \r\n  2000; Hon. LL.D., McMaster University, 2000; Hon. LL.D., University of Western \r\n  Ontario, 2000; Hon. LL.D., University of Toronto, 2000; Hon. LL.D., Glasgow \r\n  University, 2000; Hon. LL.D., Queen's University, 2000; Hon. LL.D., Carleton \r\n  University, 2000; Hon. DHumL, Mount Saint Vincent University, 2001; Hon. LL.D., \r\n  University of King's College, 2001; Hon. LL.D., University of Moncton, 2001; \r\n  Hon. LL.D., Memorial University of Newfoundland, 2001; Hon. LL.D., Windsor University, \r\n  2001; Hon. LL.D., Concordia University, 2001; Hon. LL.D., University of British \r\n  Columbia, 2001; Hon. LL.D., Lakehead University, 2002; Hon. LL.D., Université \r\n  de Picardie Jules Verne, Amiens, France, 2003. Hon. LL.D., St. Francis Xavier \r\n  University, 2003. Called to the Quebec Bar, 1971, Ontario Bar, 1977. Law Clerk \r\n  for the Honourable Mr. Justice Louis-Philippe Pigeon, Supreme Court of Canada, \r\n  1971-72; Research Officer, Law Reform Commission of Canada, 1972-73; Assistant \r\n  then Associate Professor, Osgoode Hall Law School, York University, 1974-87; \r\n  Associate Dean, Osgoode Hall Law School, 1987. Appointed to the Supreme Court \r\n  of Ontario (High Court of Justice), 1987;. Appointed to the Court of Appeal \r\n  for Ontario, 1990; Appointed as Commissioner to conduct an inquiry into certain \r\n  events at the Prison for Women in Kingston, Ontario, 1995. Appointed by the \r\n  Security Council of the United Nations as Prosecutor for the International Criminal \r\n  Tribunals for the former Yugoslavia and for Rwanda, October 1996-September 1999. \r\n  Lifetime member of the Association des juristes d'expression française \r\n  de l'Ontario, 1992; Médaille de l'Université de Montréal , \r\n  1995; Achievement Award of the Women's Law Association, Toronto, 1996; \r\n  Recipient of the G. Arthur Martin Award, Criminal Lawyers' Association, \r\n  Toronto, 1998; Medal of Honour of the International Association of Prosecutors, \r\n  1999; Médaille du mérite, Institut de recherches cliniques de \r\n  Montréa l, 1999; Prix de la Fondation\r\n  Louise Weiss, Paris , 1999; Pennsylvania \r\n  Bar Foundation's Second Annual Service to Humanity Award, Harrisburg, Pennsylvania, \r\n  2000; Franklin & Eleanor Roosevelt Four Freedoms Medal (Freedom from Fear), \r\n  Roosevelt Study Centre, Middleburg, The Netherlands, 2000; Women of Distinction \r\n  Award, Toronto Hadassah-Wizo, 2000; Peace Award, World Federalists of Canada, \r\n  2000; Lord Reading Law Society's Human Rights Award, 2000; Wolfgang Freidman \r\n  Memorial Award, Columbia Law School, 2001; EID-UL-ADHA Award, The Association \r\n  of Progressive Muslims of Ontario, 2001; Médaille du Barreau du Québec , \r\n  2001; National Achievement Award 2001, Jewish Women International of Canada, \r\n  2001; 2002 Stefan A. Riesenfeld Symposium Award, Berkeley Journal of International \r\n  Law; McGill Centre for Research and Teaching on Women Person of the Year 2002 \r\n  Award; Justice in the World International Prize, International Association of \r\n  Judges, 2002; Médaille de la Faculté de droit, Université \r\n  de Montréal , 2003; Inducted into Hall of Fame, International Women's \r\n  Forum, 2003; Honorary Fellowship, American College of Trial Lawyers, 2003; Honorary \r\n  Professor, University of Warwick, Coventry, U.K., 1999-2004; Vice President, \r\n  Canadian Civil Liberties Association, 1985-87. Honorary Member, American Society \r\n  of International Law, 2000; Member, International Crisis Group, Board of Trustees, \r\n  2000; Honorary Member, Golden Key National Honour Society, 2000; Honorary Bencher \r\n  of Grays Inn, London, England, 2001; Member of the International Council, Institute \r\n  for Global Legal Studies of Washington University School of Law, St. Louis, \r\n  Missouri, 2001; Member, Advisory Board, International Journal of Constitutional \r\n  Law, Oxford University Press (New York Law School), 2001; Member, Board of Editors, \r\n  Journal of International Criminal Justice, 2003. Appointed to the Supreme Court \r\n  of Canada, September 15, 1999. Justice Arbour retired on July 1, 2004."
    },
    {
        "Names of Judges":"The Hon. Louis LeBel",
        "Date of Appointment":"2000-01-07",
        "Date of Departure":"2014-11-29",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=louis-lebel",
        "bio":"Born in Quebec City on November 30, 1939, Louis LeBel is the son of Paul  LeBel , Q.C., and Marguerite Sasseville. On August 28, 1965, he married Louise Poudrier , a daughter of Louis-Philippe  Poudrier and Dorothée Labrie , in Quebec City. His wife, who is a lawyer and has an LL.D., was a full professor in the  law faculty of Laval University until 2000. The couple have three children, Paul,  Catherine and François , and several grandchildren. Louis LeBel received a B.A. from the Collège des Jésuites in Quebec City  in 1958 and an LL.L. from Laval University in 1961. He was awarded the Governor General's medal, the Lieutenant General's medal and the Tessier silver medal. He  was called to the Bar in 1962. He  received a graduate degree (DES) in private law from Laval University in 1965  and an LL.M. from the University of Toronto in 1966. He practised law in Quebec City, first with LeBel, Letarte, Bilodeau, Boily from 1963 to 1964 and then with Désilets,  Grondin, LeBel & Associés from 1964 to 1971, before becoming a partner at Grondin, LeBel, Poudrier, Isabel, Morin & Gagnon , where he practised from  1971 to 1984. Louis LeBel has written various legal articles and studies, and he  co-authored, with Robert-P. Gagnon and Professor Pierre Verge, Le droit du  travail en vigueur au Québec , published by Les Presses de l'Université  Laval . He has also been a member of  various committees of the Barreau de Québec (Quebec City Bar) and the Barreau  du Québec (provincial Bar association), including the editorial board of the Revue  du Barreau , which he sat on from 1976 to 1982 and chaired from 1979 to  1982. He was a member of the board of  directors of the Corporation du Centre communautaire juridique de Québec from  1973 to 1975, and sat before that on the legal aid committee of the Barreau de  Québec . He also served as Vice-president  of the Barreau du Québec from 1982 to 1983 and as Bâtonnier of Quebec from 1983  to 1984. He taught as a visiting  professor at the University of Ottawa and Laval University. He was appointed to the Quebec Court of Appeal on June 28, 1984 and to  the Supreme Court of Canada on January 7, 2000. He received an LL.D. (honoris causa ) from Laval University in 2001 and an LL.D. ( honoris causa ) from the  University of Ottawa in 2010. He was  also awarded the medal of the Barreau du Québec in 2000 and the medal of the Barreau de Québec in 2008. He has been  an Honorary Fellow of the American College of Trial Lawyers since 2004. Justice LeBel retired on November 30, 2014. Justice LeBel died on June 8, 2023, at the age of 83."
    },
    {
        "Names of Judges":"The Hon. Marie Deschamps",
        "Date of Appointment":"2002-08-07",
        "Date of Departure":"2012-08-06",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=marie-deschamps",
        "bio":"Justice Marie Deschamps received a Licentiate in Laws from the Université de Montréal in 1974  and an LL.M. from McGill University in 1983. The Université de Montréal awarded her an honorary doctorate in 2008. She was called to  the Quebec Bar in 1975 and practised as a trial lawyer at Martineau Walker and Sylvestre et Matte in commercial, family and civil law, then at Rouleau ,  Rumanek and Sirois in criminal law, and finally at Byers Casgrain in commercial  and civil law. She was appointed  to the Quebec Superior Court on March 29, 1990, to the Quebec Court of Appeal  on May 6, 1992 and to the Supreme Court of Canada on August 7, 2002. Justice Deschamps has participated in the Université de Montréal 's advocacy classes for many  years and in the Barreau du Québec 's advocacy seminars for more than 25  years. She has also been an adjunct professor in the law faculty of the Université de Sherbrooke since 2006 and in that of McGill University since 2012. She has been a member  of the board of the Université de Montréal and a member of the board of  directors of the Université de Montréal 's alumni association. She also  sat on the advisory committee on reform of the Bankruptcy Act in 1986  and on the Competition Tribunal advisory council from 1986 to 1990. She  was inducted as a member of the American College of Trial Lawyers in 2005. While at the  Supreme Court of Canada, Justice Deschamps took a particular interest in the  Court's Law Clerk Program, and she also sat on a number of committees of the  Canadian Judicial Council and the National Judicial Institute. Justice Deschamps was born in Repentigny, Quebec, on October 2, 1952. Her spouse, Paul  Gobeil , is a businessman. They have two children: Valérie and Maxime . Justice Deschamps is a sports enthusiast who skis, swims, hikes and jogs. Her interests  also include art, travel and languages (in addition to French, her mother  tongue, she speaks fluent English and has studied Italian and Spanish). She retired from  the judiciary on August 7, 2012."
    },
    {
        "Names of Judges":"The Hon. Morris J. Fish",
        "Date of Appointment":"2003-08-05",
        "Date of Departure":"2013-08-30",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=morris-j-fish",
        "bio":"Justice Fish, son of Aaron S. Fish and Zlata Grober, was born in  Montréal, Québec, on November 16, 1938. He married Judith Chinks, daughter of  Henry I. Chinks and Freda Morowitz, on December 25, 1966. They have two  daughters, Amy and Laura, and five grandchildren. Justice Fish received a B.A. (with Distinction) from McGill University  in 1959 and a B.C.L. (with First Class Honours) from the Faculty of Law at  McGill in 1962, where he was a University Scholar and was elected Permanent  Class President. Upon graduation from law school, he was awarded the  Greenshields Prize, the Crankshaw Prize for Highest Standing in Criminal Law  and the Macdonald Travelling Scholarship. During the ensuing year, 1962-63,  he pursued postgraduate studies in Constitutional Law and Public Liberties at  the Université de Paris. Justice Fish was called to the Bars of Quebec in 1964, Prince Edward  Island in 1968 and Alberta in 1974. He was an associate (1964-67)  and partner (1967-89)  in the Montréal law firm of Cohen, Leithman, Kaufman, Yarosky and Fish (and  successors firms), and was created a Queen's  Counsel in 1984. An Adjunct Professor in the Faculty of Law at McGill University, Justice  Fish taught there as a sessional lecturer in Criminal Evidence and Procedure  (1973-80)  and Advanced Criminal Law (1986-89).  From 1971 to 1974, he taught Les crimes économiques at the Faculty of Law,  University of Ottawa; and, from 1969 to 1971, Droit pénal , at the Université de  Montréal . He has over the years contributed to legal periodicals and lectured  at numerous legal and judicial conferences in Canada and abroad. Justice Fish has served as a consultant to the Federal Department of  Justice, to Revenue Canada and to the Law Reform Commission of Canada, and as  special counsel to the Québec Commission of Inquiry on the Construction  Industry (\"Cliche  Commission\")  and the Security Intelligence Review Committee.  He was a member of the Board of Directors of the Legal Aid Bureau of  Montréal (1968-73);  a member and chair of various committees of the Bar of Montréal and the Bar of  Québec (1969-76);  chair of the Québec Rhodes Scholarship Selection Committee (2000-2003,  2006); and member (1994- ) and chair (1996-2003)  of the Advisory Board of the Faculty of Law at McGill University. Justice Fish received an honourary LL.D. from McGill University in 2001,  and an honourary LL.D. from Yeshiva University in 2009. He was elected an  Honorary Fellow of the American College of Trial Lawyers in 2006, and was  awarded the F.R. Scott Medal by the Faculty of Law at McGill in 2006, the Medal  of Recognition of the International Society for the Reform of Criminal Law in  2008, and the G. Arthur Martin Medal in 2011 for his contribution to criminal  justice in Canada.  He delivered the  H.L.A. Hart Memorial Lecture at Oxford University in 2007 and the Goodman  Fellowship Lecture at the Faculty of Law, University of Toronto, in 2004. While pursuing his legal studies, and later his career at the bar,  Justice Fish was a staff reporter and editorial writer for The Montreal Star (1959-70),  with special assignments in France, Sweden, Israel, Greece, Taiwan, Japan, the  United States and the former USSR. Appointed to the Québec Court of Appeal on June 30, 1989, Justice Fish  was elevated to the Supreme Court of Canada on August 5, 2003. He  retired on August 31, 2013."
    },
    {
        "Names of Judges":"The Hon. Rosalie Silberman Abella",
        "Date of Appointment":"2004-08-30",
        "Date of Departure":"2021-06-30",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=rosalie-silberman-abella",
        "bio":"Justice Abella was appointed to the Supreme Court of  Canada in 2004. She is the first Jewish woman appointed to the Court. She was elected to the Royal Society of Canada in 1997,  to the American Academy of Arts and Sciences in 2007, and to the American  Philosophical Society in 2018. In 2020, she was awarded the Knight Commander‘s  Cross of the Order of Merit by the President of Germany. She attended the University of Toronto, where she  earned a B.A. in 1967 and an LL.B. in 1970. In 1964 she graduated from the  Royal Conservatory of Music in classical piano. She was called to the Ontario  Bar in 1972 and practised civil and criminal litigation until 1976 when she was  appointed to the Ontario Family Court at the age of 29, the first pregnant  person appointed to the judiciary in Canada. She was appointed to the Ontario  Court of Appeal in 1992. She was Chair and author of the Ontario Study on  Access to Legal Services by the Disabled in 1983 and the sole Commissioner of  the 1984 federal Royal Commission on Equality in Employment, creating the term  and concept of \"employment equity\". The theories of  \"equality\" and \"discrimination\" she developed in her Royal  Commission Report were adopted by the Supreme Court of Canada in its first  decision dealing with equality rights under the Canadian Charter of  Rights and Freedoms in 1989. The report has been implemented by the  governments of Canada, New Zealand, Northern Ireland and South Africa. She subsequently served as Chair of the Ontario Labour  Relations Board (1984 to 1989), Chair of the Ontario Law Reform Commission  (1989 to 1992), and Boulton Visiting Professor at the Faculty of Law of McGill  University (1988 to 1992). She also served as a commissioner on the Ontario  Human Rights Commission; as a member of the Ontario Public Service Labour  Relations Tribunal;  as Co-Chair of the University of Toronto Academic  Discipline Tribunal; and as a member of the Premier's Advisory Committee on Confederation. She has written over 90 articles and written or  co-edited four books. She was made a Senior Fellow of Massey College in 1989,  has given, among others, the Harlan Lecture at Princeton, the Ryan Lecture at  Georgetown, the Winchester Lecture at Oxford, the Anderson Lecture at Yale, the  Robert L. Levine Distinguished Lecture at Fordham Law School, the Diane  Markowicz Memorial Lecture at Brandeis University, and the David J. Bederman  Lecture in International Law at Emory University School of Law. She  was the first Bullock Chair at the  Hebrew University, the Mackenzie King Distinguished Visiting Professor at  Harvard, the Floersheimer Distinguished Jurist in Residence at Cardozo Law  School, a Distinguished Visiting Faculty at the University of Toronto Law  School, and Bright International Jurist in Residence at the University of  Hawaii School of Law. She was a judge of the Giller Literary Prize; Chair of  the Rhodes Selection Committee for Ontario; director of the Institute for  Research on Public Policy; moderator of the English Language Leaders' Debate in  1988; a member of the Canadian Judicial Council's Inquiry on Donald Marshall,  Jr.; Program Chair of the Governor General's Canadian Study Conference; Chief  Rapporteur in Halifax and Co-Chair in Vancouver of the 1992 Renewal of Canada  Conferences; Trustee of the McGill Institute for the Study of Canada; Governor  of the International Board of Governors of the Hebrew University; and  Vice-Chair of the Board of Governors of the National Judicial Institute. Justice Abella has been active in Canadian judicial  education, organizing the first judicial seminar in which all levels of the  judiciary participated, the first judicial seminar in which persons outside the  legal profession were invited to participate, the first national education  program for administrative tribunals, and the first national conference for  Canada's female judges. She has 39 honourary degrees. She was also  awarded the Distinguished Alumnus  Award of the University of Toronto Faculty of Law; the Alumni of Influence  Award from University College; the Distinguished Service Award of the Canadian  Bar Association (Ontario); the International Justice Prize of the Peter Gruber  Foundation; the Human Relations Award of the Canadian Council of Christians and  Jews; the Honourable Walter S. Tarnopolsky Human Rights Award; the Bora Laskin  Award for Distinguished Service in Labour Law; the Global Jurist of the Year  from Northwestern Pritzker School of Law; the Ethical Leadership Award from the  Faculty of Management at Dalhousie University; the Calgary Peace Prize; the  Women in Law Lifetime Achievement Award; the Goler T. Butcher Medal for  International Human Rights from the American Society of International Law; the Gunther  Plaut Humanitarian Award; the Rose Wolfe Distinguished Alumni Award;  an Honourary Bencher of Middle Temple; and was a Harvard Law School Honoree on International Women’s Day. Upon retirement from the  Court, she will be the Samuel and Judith Pisar Visiting Professor of Law at  Harvard Law School. She will also be a Senior Research Scholar at Yale Law  School and Distinguished Visiting Jurist at the University of Toronto Faculty  of Law. In the spring of 2022, she will be the William Hughes Mulligan  Distinguished Visiting Professor in International Studies at Fordham Law  School. Justice Abella was born in a Displaced Person's Camp  in Stuttgart, Germany on July 1, 1946. Her family came to Canada as refugees in  1950. She is the first refugee appointed to the bench in Canada. She is married  to Canadian historian Irving Abella and they have two sons, Jacob and Zachary,  both lawyers.  She retired on July 1 st , 2021. The Honourable Rosalie Silberman Abella bids farewell to the Supreme Court ."
    },
    {
        "Names of Judges":"The Hon. Louise Charron",
        "Date of Appointment":"2004-08-30",
        "Date of Departure":"2011-08-29",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=louise-charron",
        "bio":"Born on March 2, 1951, Justice Louise Charron received her primary and secondary education in Sturgeon Falls, Ontario.  She is married to William Blake and has one child, Gabriel Poliquin, and two step-sons, Michael and Steven Blake. She received a B.A. from Carleton University in 1972 and an LL.B. from the University of Ottawa in 1975.  Called to the Ontario Bar in 1977, she practised law with the firm of Lalonde & Chartrand from 1977 to 1980, mostly in civil and criminal litigation. She served as Assistant Crown Attorney for the Judicial District of Ottawa-Carleton from 1978 to 1988, holding this position on a full-time basis from 1980 to 1985.  She was a lecturer in the French common law section of the University of Ottawa’s Faculty of Law from 1978 to 1985, when she joined the Faculty as Assistant Professor, a position she held until 1988. Justice Charron was appointed a District Court Judge and Local Judge of the High Court of Ontario in Ottawa in 1988 and Judge of the Ontario Court of Justice (General Division) in 1990.  An educator at heart, she has been actively involved in moot courts and in continuing education for judges and lawyers, and was Associate Director of the National Judicial Institute from 1994 to 1996. Justice Charron was appointed Judge of the Ontario Court of Appeal in 1995 and Deputy Judge of the Nunavut Court of Justice from 1999 to 2004.  She was appointed to the Supreme Court of Canada on August 30, 2004. She has received Honorary LL.D.s from the Law Society of Upper Canada in 2004, from Nipissing University in 2005 and from Sudbury’s Laurentian University in 2006.  She was elected to honorary fellowship in the American College of Trial Lawyers in 2007. Justice Charron retired on  August 30, 2011."
    },
    {
        "Names of Judges":"The Hon. Marshall Rothstein",
        "Date of Appointment":"2006-03-01",
        "Date of Departure":"2015-08-30",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=marshall-rothstein",
        "bio":"Born on December 25, 1940 in Winnipeg, Manitoba, Marshall Rothstein went  to school in Winnipeg. He then attended the University of Manitoba, where he  earned a B. Com. in 1962 and an LL.B. in 1966. He is married to Montreal native Sheila Dorfman and the couple have four  children, Ronald, Douglas, Tracey and Robert, and six grandchildren. After being called to the Manitoba Bar in 1966, he started his career at  Thorvaldson, Eggertson, Saunders and Mauro before moving to Aikins, MacAulay  & Thorvaldson in 1969, where he was a partner from 1972 to 1992 and a  member and periodic Chairman of the Management Committee\/Executive Board from  1981 to 1992. He was appointed Queen's  Counsel in 1979. He served as an  adjudicator under the Manitoba Human Rights Act from 1978 to 1983 and as  a member of the Canadian Human Rights Tribunal from 1986 to 1992. In his practice, he appeared before federal and Manitoba administrative  tribunals, the Manitoba Court of Queen's  Bench, the Manitoba Court of Appeal, the Federal Court - Trial Division, the  Federal Court of Appeal and the Supreme Court of Canada. Justice Rothstein taught transportation law  as a lecturer in the University of Manitoba's  Faculty of Law from 1970 to 1983 and from 1988 to 1992, and contract law in the  University's  Extension Department from 1970 to 1975. He was a Bar Admission Course lecturer for the Law Society of Manitoba  from 1970 to 1975. He also held many other offices: Secretary (Administrator),  Civil Legal Aid Committee, Law Society of Manitoba, 1968-70; Chairman,  Commission on Compulsory Retirement (Manitoba), 1981-82; Chairman, Ministerial  Task Force on International Air Policy (Canada), 1990-91; Member and Chairman,  Manitoba Transportation Industry Development Advisory Committee, 1985-87 and  1987-90 respectively; Member, Airports Task Force, 1985-86; Member, Airports  Transfer Advisory Board, 1988-92; and Member, External Advisory Committee,  University of Manitoba Transport Institute, 1989-92. Justice Rothstein was appointed to the Trial Division of the Federal  Court of Canada on June 24, 1992; while a judge of the Trial Division, he also  served as a member ex officio of the Appeal Division, a judge of the  Court Martial Appeal Court of Canada and a judicial member of the Competition  Tribunal. He was elevated to the Federal  Court of Appeal on January 21, 1999, and, finally, to the Supreme Court of  Canada on March 1, 2006. He retired on August 31, 2015."
    },
    {
        "Names of Judges":"The Hon. Thomas Albert Cromwell",
        "Date of Appointment":"2008-12-22",
        "Date of Departure":"2016-08-31",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=thomas-albert-cromwell",
        "bio":"The  Honourable Thomas Cromwell was appointed to the Supreme Court of Canada on  December 22, 2008. He had previously  been appointed to the Nova Scotia Court of Appeal on August 27, 1997. Justice  Cromwell went to school in Kingston. He then attended Queen's University, where he  obtained a B. Mus. in 1973 and an LL.B. in 1976. He also obtained an A.R.C.T. diploma from the  Royal Conservatory of Music in 1974 and attended Oxford University, where he  earned a B.C.L. in 1977. Justice  Cromwell practised law in Kingston and Toronto and taught in the Faculty of Law  of Dalhousie University. He worked as  Executive Legal Officer to Chief Justice Antonio Lamer for three years,  1992-95. He has also held many other  offices: Secretary, Board of Governors, National Judicial Institute, 1992-95;  Vice-chair, Nova Scotia Labour Relations Board and Construction Industry Panel,  1991-92; labour arbitrator and adjudicator, 1984-97; President, Continuing  Legal Education Society of Nova Scotia; President, Canadian Association of Law  Teachers, 1988-89; President, Canadian Institute for the Administration of  Justice, 1999-2001; Chair of the Board, Canadian Forum on Civil Justice, 2007-8;  Research Director, C.B.A. Court Reform Task Force, 1989-91; Chair, C.B.A.  Interim Organizational Committee for the National Organization on Civil Justice  Reform, 1996-97; and Commissioner, Law Reform Commission of Nova Scotia, 2002-7. He  currently serves as Chair of the National Action Committee on Access to Justice  in Civil and Family Matters. Justice  Cromwell was an active member of the Canadian Judicial Council's working committee that  prepared the publication entitled Ethical Principles for Judges as well  as the Council's working committee on Jury  Charges and Education Committee. He was also a faculty member of the programs  for new federally and provincially appointed judges, the National Judicial  Institute's Intensive Evidence  Program, and many other national and provincial continuing education programs,  including the Effective Written Advocacy Program of the Advocates' Society. He has authored or contributed to six books  and numerous articles and served on the editorial boards for CRIMJI and the Canadian  Journal of Administrative Law and Practice . He is Chair of the Editorial  Board of the Canadian Bar Review. Justice  Cromwell has received many awards: the C.B.A.'s Louis St. Laurent  Award of Excellence, 1992; Her Majesty's Jubilee Medals, 2002 and 2012; the Dalhousie Law  Students Society and Dalhousie Law Alumni Association Award of Teaching  Excellence, 1992; and the Dalhousie Law Students' Society Class of 1986 Class  Ring. He is an Honorary Director of the Canadian Institute for the  Administration of Justice, an Honorary member of the Golden Key International  Honour Society, and an Honorary Fellow of Exeter College Oxford and of the  American College of Trial Lawyers. He holds honorary doctorates in law from  Dalhousie University, Halifax, Queen's University, Kingston and the Law Society  of Upper Canada. He retired on September 1, 2016. Webcast of the ceremony in honour of the Honourable Thomas A. Cromwell , held on February 16, 2009."
    },
    {
        "Names of Judges":"The Hon. Michael J. Moldaver",
        "Date of Appointment":"2011-10-21",
        "Date of Departure":"2022-08-31",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=michael-j-moldaver",
        "bio":"Born in 1947, Justice Moldaver spent his formative years in Peterborough,   Ontario. He attended the University of Toronto, where he earned a Bachelor of   Arts in 1968 and a Bachelor of Laws in 1971 (Gold  Medalist). He is married to Rivka (\"Riky\")   Moldaver and has two daughters, Shannon and Jessica, and two grandchildren. Justice Moldaver articled with the law firm of Thomson Rogers and then with   Mr. G. Arthur Martin, and was called to the Ontario Bar in 1973. He began his   criminal law practice with the law firm of Pomerant, Pomerant and Greenspan   (later Greenspan, Gold and Moldaver), where he became a partner in 1975. Justice   Moldaver was appointed Queen’s Counsel in 1985. After practising as a sole   practitioner for two years, he was affiliated with the law firm of Goodman and   Goodman from 1988 until his appointment to the Bench. While in practice, Justice   Moldaver was Director of the Criminal Lawyers' Association, Director of the   Advocates' Society and Co-Chair of the University of Toronto Academic Tribunal,   Discipline Subsection. He co-chaired the 1989 Advocacy Symposium at Massey Hall   as well as the 1990 Advocacy Symposium at Roy Thomson Hall in Toronto, which   featured a panel composed of Canadian Chief Justice Dickson, U.S. Chief Justice   Rehnquist, and U.K. Lord Chancellor MacKay. Justice Moldaver began his judicial career as a member of the High Court of   Justice for Ontario when he was appointed to the Supreme Court of Ontario (later   the Ontario Court of Justice (General Division)) on April 12, 1990. He was   elevated to the Court of Appeal for Ontario on December 22, 1995 and to the   Supreme Court of Canada on October 21, 2011. Throughout his career, Justice Moldaver has played an active role in the   legal community.  From 1978 to 1995, he co-taught criminal law courses at   Osgoode Hall Law School and at the University of Toronto Law School. He has   acted as a speaker and an instructor in numerous continuing education programs   for both the judiciary and the profession, participating in educational programs   sponsored by the National Judicial Institute and the Canadian Institute for the   Administration of Justice, teaching criminal law to newly appointed judges from   across Canada, and instructing in the Ontario Crown Attorneys' Association,   Criminal Lawyers' Association and Ontario Bar Association continuing education   programs. Justice Moldaver is an Honorary Fellow of the American College of   Trial Lawyers. He received a degree of Doctor of Laws honoris causa from the University of Toronto in 2019. He retired on September 1st, 2022. Webcast of the ceremony in honour of the Honourable Michael J. Moldaver , held on November 14, 2011. The Honourable Michael J. Moldaver bids farewell to the Supreme Court ."
    },
    {
        "Names of Judges":"The Hon. Andromache Karakatsanis",
        "Date of Appointment":"2011-10-21",
        "Date of Departure":null,
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=andromache-karakatsanis",
        "bio":"Justice  Andromache Karakatsanis was appointed to the Supreme Court of Canada in October  2011. She had been appointed a judge of the Court of Appeal for Ontario in  March 2010 and a judge of the Ontario Superior Court of Justice in December  2002. Justice  Karakatsanis is a graduate of the University of Toronto and Osgoode Hall Law  School. Following  her call to the Bar in 1982, Andromache Karakatsanis served as a law clerk to  the Ontario Court of Appeal. In private practice, she practised criminal, civil  and family litigation in Toronto for several years. She then served in the  Ontario Public Service for 15 years in a number of senior positions. During  her career in public service, Andromache Karakatsanis served as Chair and Chief  Executive Officer of the Liquor Licence Board of Ontario (1988-95); as  Assistant Deputy Attorney General and Secretary for Native Affairs (1995-97);  and as Deputy Attorney General (1997-2000). Andromache  Karakatsanis served as Ontario's Secretary of the Cabinet and Clerk of the  Executive Council from July 2000 to November 2002. As the province's senior  public servant, she provided leadership to the Ontario Public Service and to the  deputy ministers. While  in the public service, Justice Karakatsanis was actively involved in issues  related to education and reform in the field of administrative justice. She was  a recipient of the Society of Ontario Adjudicators and Regulators (SOAR) Medal  in 1996 for outstanding service to Ontario's administrative justice system. Justice  Karakatsanis volunteered extensively with the YMCA of Greater Toronto from 1990  to 2002 and held a number of senior positions, including that of Chair of the  Board of Directors. She also served as a member of the Board of the Public  Policy Forum and of Canadian Policy and Research Networks (CPRN). Justice  Karakatsanis was born in Toronto on October 3, 1955. She is married to Tom  Karvanis and they have two children, Paul and Rhea. Webcast of the ceremony in honour of the Honourable Andromache Karakatsanis , held on November 14, 2011."
    },
    {
        "Names of Judges":"The Hon. Richard Wagner",
        "Date of Appointment":"2012-10-05",
        "Date of Departure":"2017-12-18  Footnote 1",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=richard-wagner",
        "bio":"The Right Honourable  Richard Wagner is the 18th Chief Justice of Canada. In this role, he  presides over the Canadian Judicial Council Canadian Judicial Council , National Judicial  Institute National Judicial  Institute and chairs  the Advisory  Council for the Order of Canada Advisory Council for the Order of Canada . Chief Justice Wagner was president of the Association  des Cours Constitutionelles Francophones from 2019 to 2022 . The Chief Justice also fulfilled his  duty to serve as administrator administrator of the Government of Canada from  January 23 to July 26, 2021. Born and raised in  Montreal, Chief Justice Wagner earned his Bachelor of Social Science and  Licentiate in Laws at the University of Ottawa. He returned to his home town to  practice law from 1980 to 2004. His areas of specialization included professional  liability, commercial litigation and class action lawsuits. As a litigator the Chief  Justice argued cases before every level of court in Quebec, quasi-judicial  tribunals, as well as the Federal Court and the Supreme Court of Canada. Throughout  his legal career, Chief Justice Wagner led initiatives to help lawyers  constantly upgrade their skills and knowledge, such as the creation of the Centre d’accès à l’information juridique Centre d’accès à l’information juridique in 2002, for which initiative he was awarded the Mérite du Barreau du Québec in  2005. In 2022, in recognition of his longstanding contribution to the cause of  justice, the Bar of Montreal awarded him its highest distinction, the Medal of  the Bar of Montreal. In addition, for his outstanding contribution to upholding  and promoting the rule of law, the World Jurist Association presented him with  its Medal of Honor at a ceremony at the United Nations in New York in 2023. Chief Justice Wagner was  appointed a judge of the Superior Court of Quebec in 2004 and was named to the  Quebec Court of Appeal in 2011. On October 5, 2012, he was appointed to the  Supreme Court of Canada. He was named the Court’s Chief Justice on December 18,  2017. At his Supreme Court welcoming ceremony, Chief Justice Wagner spoke of  the need to for more transparency in the justice system, “Judges and courts  must adjust and must explain who they are, what they do and how they do it.” In that regard, the Chief  Justice works very closely with the Supreme Court Registrar Registrar . The Court has introduced  plain-language summaries of decisions called Cases in Brief Cases in Brief and produces an annual report called  the Year in Review. Year in Review . The Chief Justice now holds an annual  news conference and has directed the Supreme Court, for the first time in its  history, to hear cases outside Ottawa. In 2019 it traveled to Winnipeg where it  heard two cases and judges conducted activities in the community. The Court conducted a similar trip to Quebec City in  2022. Chief Justice Wagner is  a steadfast advocate for better access to justice for all Canadians. He  encourages better funding for legal aid, urges lawyers to do more pro bono work  and supports structural reforms to further modernize the justice system. As a litigator and a  judge, the Chief Justice has championed civility in and outside the courtroom,  “Even if people reading our decisions don’t agree with an outcome, we have to  ensure they respect them. If we let emotion get the best of us, our decisions  become suspect, and so do we.” Civility and collegiality were the focus of his  speech at the 2019  Cambridge Lectures. 2019  Cambridge Lectures . A passionate defender of  the principle of judicial independence, the Chief Justice and Minister of  Justice David Lametti signed an Accord Accord in 2019 to formally recognize the  Supreme Court’s full independence from the federal Department of Justice. \r\n  “A judiciary that is  independent – and seen to be independent – benefits all Canadians,” said the  Chief Justice. Judicial career Quebec  Superior Court for the District of Montréal  – September 24, 2004-February 3, 2011 Quebec Court of Appeal – February 3, 2011-October 5, 2012 Supreme Court of  Canada – October 5, 2012-present Chief  Justice of Canada – December 18,  2017-present Legal practice Called to the Quebec Bar (1980) Lavery, de Billy – formerly  Lavery, O’Brien and Lavery, Johnston, Clark, Carrière, Mason & Associés  (1980-2004) Associate (1980-1987) Partner (1988-2004) Other professional activities Canadian Bar Association (1980-2004) Board member of Quebec Branch President of the Construction  Law Section (among others) Bar of Montréal (1980-2004) Elected positions: Councillor  (1998-2000), First Councillor (2000-2001), Bâtonnier (2001-2002) Chair of the Superior Court  liaison committee, Chair of the ad hoc committee on Quebec law libraries Barreau du Québec (1980-2004) General Council member Chair of the applications  committee, member of several committees (including administration and finance) Canadian College of Construction Lawyers   CCCL (1998-2004) Founding Fellow École du Barreau du Québec Lecturer in trial advocacy  (1989-90 and 2001) Lecturer on civil procedure  under both the former and new Code of Civil Procedure (2003) Centre  d’accès à l’information juridique   CAIJ (2002-2004) Member of Board of Directors  and Vice-President Superior  Court of Quebec (2004-2011) Sat on several court  committees, including judicial practice committee (which oversaw training of  newly-appointed judges) Conférence  des juges des cours supérieures du Québec (2006-2011) Member of the Board of  Directors (2006-2011) President (2009-2011) Canadian Superior Court Judges Association (2011-2012) Member of the Board of  Directors Sat on the Judicial Conduct  Review Committee and the Remuneration Committee Canadian Judicial Council Chair National  Judicial Institute Chair of the Board of Governors Advisory  Council for the Order of Canada Chair The Honourable Society of the Middle  Temple (2019-present) Honourary  Bencher The Honorable Society of King’s Inns (2022-present) Honorary Bencher Friends of the McGill Library (2018-present) Honourary Friend Action Committee on Access to  Justice in Civil and Family Matters (2018-present) Honourary President Canadian Institute for Advanced Legal Studies (2020-present) Patron Association  des Cours Constitutionnelles Francophones   ACCF (2019-present) President (2019-2022) Member of the Executive Committee (2019-present) Action  Committee on Court Operations in Response to COVID-19 (2020-present) Co-Chair Academic history Diploma of College Studies  (DEC), Collège Jean-de-Brébeuf – 1975 Bachelor of Social Sciences  (B.Soc.Sc.) with major in Political Science, University of Ottawa ( cum laude ) – 1978 Licentiate in Laws (LL.L.),  University of Ottawa Faculty of Law ( cum  laude ) – 1979 Honorary doctorate, University  of Ottawa Faculty of Law – 2019 Honorary doctorate, Law Society of Ontario – 2023"
    },
    {
        "Names of Judges":"The Hon. Clément Gascon",
        "Date of Appointment":"2014-06-09",
        "Date of Departure":"2019-09-14",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=clement-gascon",
        "bio":"Mr. Justice Clément Gascon was born in Montreal,  Quebec in  1960.  He is the  son of Dr. Bernard Gascon and Denyse Clément.   He studied at Collège Jean-de-Brébeuf (D.E.C. 1978) and McGill University  (B.C.L. 1981\/Upper Second Class Honours and University Scholar).  He has been married since 1983 to the  Honourable Marie Michelle Lavigne, a judge of the Court of Québec, Civil  Division.  They have three children. After being called to the Quebec Bar in 1982, he  practised law for 21 years at Heenan Blaikie in Montreal, working primarily in  civil and commercial litigation and in labour law.  He sat on the firm's National Executive  Committee and National Management Committee from 1994 to 2002.  He was the partner responsible for the litigation  department from 1994 to 1999. While working as a lawyer, he also taught  business law, labour law and construction law at the Département des sciences  comptables of the Université du Québec à Montréal , at the McGill University  Faculty of Law and at the Barreau du Québec.   In addition, he co-authored a number of books, publications and articles  on the individual contract of employment that dealt in particular with  termination of employment, restrictive covenants, fiduciary duty and unfair  competition. He was appointed to the Quebec Superior Court  on October 10, 2002.  While on that  court, he sat regularly, although not uniquely, as a member of the Commercial  Division, and he also acted as the Division's coordinating judge from 2008 to 2011.   The Commercial Division hears all  commercial law cases, including restructurings under the Companies' Creditors Arrangement Act (CCAA) , proceedings under the Bankruptcy and Insolvency Act (BIA) and disputes between shareholders. He also served from 2007 to 2010 as the  Superior Court's representative on the committee on class actions of the CBA 's  Quebec Branch.  He assumed the same role on the working group that  studied the U.S.-Canada Cross-Border  Class Action Protocols . From 2007 to 2012, he co-chaired the Judgment  Writing Seminar of the Canadian Institute for the Administration of Justice,  where he continues to participate as speaker.  He is also a faculty member at the Seminar for  New Federally Appointed Judges.  He has  participated in numerous continuing legal education seminars for judges on  commercial law, class actions and judgment writing. He was appointed to the Quebec Court of Appeal  on April 5, 2012 and to the Supreme Court of Canada on June 9, 2014. He retired on September 15, 2019. Webcast of the ceremony in honour of the Honourable Clément Gascon ,  held on October 6, 2014. The Honourable Clément Gascon bids farewell to the Supreme Court ."
    },
    {
        "Names of Judges":"The Hon. Suzanne Côté",
        "Date of Appointment":"2014-12-01",
        "Date of Departure":null,
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=suzanne-cote",
        "bio":"The Honourable Suzanne Côté was appointed to  the Supreme Court of Canada on December 1, 2014. Before her appointment to the Supreme Court of  Canada, Justice Côté was a partner at Osler, Hoskin & Harcourt LLP, where  she was head of the Montréal office’s litigation group. Before joining Osler,  Hoskin & Harcourt, Justice Côté had practised for 23 years at Stikeman  Elliott, where she was also head of the Montréal office’s litigation group. She  specialized in complex civil and commercial litigation, including cases  involving manufacturer’s liability, class actions, shareholder disputes and  public law. Before she started working for major law firms,  Justice Côté practised for approximately 8 years in the Gaspé Peninsula, where  she had been born. Justice Côté received the Advocatus Emeritus distinction  from the Barreau du Québec in 2011.  In  addition, she has been a Fellow of the American College of Trial Lawyers since 2005. Justice Côté’s competence as a litigator was  recognized on many occasions, including in the following publications: Best  Lawyers in Canada (2014) — Corporate and Commercial Litigation and Class  Action Litigation; Benchmark Litigation  Canada (2014) — Litigation Star (Quebec); BTI Client Service All-Star (2011); The Lexpert\/American Lawyer Guide  to the Leading 500 Lawyers in Canada (2014) — Litigation - Corporate Commercial; The Lexpert Guide to the Leading  Canada\/US Cross-Border Litigation Lawyers in Canada (2012) — Corporate Commercial; The Canadian Legal Lexpert Directory (2014) —  Litigation - Corporate Commercial (Most Frequently Recommended), Litigation - Directors’  and Officers’ Liability, Class Actions, Litigation - Public Law, Litigation - Securities; Lexpert Special Edition - Canada’s Leading Litigation Lawyers (2012); Chambers Global guide of the world’s leading  business lawyers(2014) — Dispute  Resolution (Quebec); Le monde juridique (2008)  — named litigator of the year; and Lexpert (September 2003), in which Justice Côté was named in a feature article on  Canada’s 25 best lawyers. Justice Côté argued cases in various trial  courts, as well as in the Quebec Court of Appeal, the Federal Courts and the  Supreme Court of Canada.  She had received an LL.B. from Université Laval  before being called to the Quebec Bar in 1981. Justice Côté has taught evidence and litigation  at the École du Barreau du Québec , and has also lectured at the Université du  Québec à Rimouski and at the Université de Montréal .  She has also contributed for many years to the  organization of the annual Coupe Guy-Guérin trial advocacy competition, a  provincial competition that leads to participation in the Sopinka Cup.  Finally, she has given many lectures relating  to various areas of the law. Justice Côté has been a member of the board of  directors of the Fondation Jean Duceppe and has also worked for years with the  Canadian National Institute for the Blind. Originally from the  Gaspésie, Justice Côté was a member of the board of directors of the Société d’histoire  de la Gaspésie and president of both the Gaspé Chamber of Commerce and the Chambre  de Commerce de la Gaspésie . Webcast of the ceremony in honour of the Honourable Suzanne Côté , held on February 10, 2015."
    },
    {
        "Names of Judges":"The Hon. Russell Brown",
        "Date of Appointment":"2015-08-31",
        "Date of Departure":"2023-06-12",
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=russell-brown",
        "bio":"Justice Russell Brown was born in Vancouver on September 15,  1965, and raised in Burns Lake, British Columbia. He holds degrees from the  University of British Columbia (BA), the University of Victoria (LLB) and the  University of Toronto (LLM, SJD). He was admitted to the Bars of British  Columbia (1995) and Alberta (2008), and practiced at Davis & Company (now  DLA Piper LLP) in Vancouver from 1995 to 1996 and at Carfra & Lawton (now  Carfra Lawton LLP) in Victoria from 1996 to 2004. From 2008 to 2013, he was  associate counsel to Miller Thomson LLP. From 2004 to 2013, Justice Brown was a  member of the Faculty of Law at the University of Alberta, variously as professor  and associate dean. His main areas of practice were commercial law, medical  negligence, public authority liability, insurance law and trusts and estates. Justice Brown is the author of a treatise on claims under  negligence law for economic loss, a contributing author to a textbook on public  authority liability, as well as the author or co-author of over 40 published  law review articles, book chapters, review essays and forward essays on tort  law, property law and civil justice. He is a regular contributor to academic  and professional conference proceedings in Canada and internationally, and in  Canadian judicial education seminars. Justice Brown presently serves on the  editorial board of the University of Toronto Law Journal and the  advisory board of the Legal Writing Academy at the University of Ottawa.   Prior to his judicial career, he served on various committees of the Law  Society of Alberta, including those on credentials and education, and civil  practice, and was a member of the governing board of the Canadian Forum on  Civil Justice. He also served as chair of the Health Law Institute of the  University of Alberta, chair of the University Appeals Board and chair of the Professional  Review Board at the University of Alberta. He was appointed to the Court of Queen's Bench of Alberta on  February 7, 2013, and to the Court of Appeal of Alberta on March 7, 2014.  Justice Brown also served as a Judge of the Court of Appeal for the Northwest  Territories and a Judge of the Court of Appeal of Nunavut. He was appointed to  the Supreme Court of Canada on August 31, 2015. Justice Brown is a Fellow of the Royal Canadian Geographical  Society, and previously served on the Advisory Board to the Salvation Army in  Victoria and in Edmonton (where he also served as board chair). He retired on June 12, 2023. Webcast of the ceremony in honour of the Honourable Russell  Brown , held on October 6,  2015."
    },
    {
        "Names of Judges":"The Hon. Malcolm Rowe",
        "Date of Appointment":"2016-10-28",
        "Date of Departure":null,
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=malcolm-rowe",
        "bio":"Justice Rowe was born in 1953  in St. John’s, Newfoundland and Labrador. He attended Memorial University from  1970 to 1975 where he earned a B.Sc., and a B.A. He attended Osgoode Hall Law  School from 1975 to 1978, where he earned his LL.B. He was called to the Bar of  Newfoundland and Labrador in 1978 and became a member of the Law Society of  Upper Canada in 1986. Justice Rowe first worked as  Clerk Assistant in the House of Assembly of Newfoundland and Labrador, where he  served as procedural advisor to the Speaker. In 1980, he joined the Department  of External Affairs as a Foreign Service Officer. In 1984, he joined the Ottawa  office of Gowling and Henderson, first as an associate and then as a partner.  While in private practice, he was part of the legal team that took the dispute over  the determination of Canada’s maritime boundary around the French islands of  St. Pierre et Miquelon to international arbitration. He was intensively involved  in international negotiations and litigation concerning high seas overfishing  on the Grand Banks of Newfoundland. As part of this undertaking, he was also  involved in negotiation of a new United Nations convention on high seas  fisheries, initiatives at the UN Food and Agriculture Organization and extended  negotiations with the European Union. He was appointed Queen’s Counsel in 1992.  In 1996, he became Clerk of the Executive Council and Secretary to Cabinet in  the Government of Newfoundland and Labrador. While in this position, he  continued to advise Canada’s litigation team in the high seas fisheries case  brought by Spain before the International Court of Justice. Also while head of  the public service, he was instrumental in securing a constitutional amendment  to replace Newfoundland and Labrador’s denominational school system with a  public system. Justice Rowe was appointed to the Newfoundland and Labrador  Supreme Court, Trial Division in 1999 and was elevated to the Court of Appeal  in 2001. Justice Rowe served as a  lecturer in public and constitutional law at the University of Ottawa, Faculty  of Law, as well as Chair of the International law section of the Canadian Bar  Association. He has published various articles on public and international law.  He served on the Board of Directors of the Canadian Superior Courts Judges’  Association. He was Chair of the Advisory Committee on Federal Judicial  Appointments for Newfoundland and Labrador from 2006 to 2012. From 2002 to  2016, he was involved with Action Canada, a youth leadership development  program, as an advisor, mentor and member of the National Selection Committee.  He was appointed to the Supreme Court of Canada on October 28, 2016. Webcast of the ceremony in honour of the Honourable Malcolm Rowe ,  held on December 2,  2016."
    },
    {
        "Names of Judges":"The Hon. Sheilah L. Martin",
        "Date of Appointment":"2017-12-18",
        "Date of Departure":null,
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=sheilah-l-martin",
        "bio":"Born and raised in Montréal, Justice Sheilah L. Martin was trained in both civil law and common law before moving to Alberta where her career as an educator, lawyer, and judge has been driven by a commitment to fairness and equal justice for all. Justice Martin earned a Bachelor of Civil Law and a Bachelor of Common Law from McGill University in 1981. She then received a Master of Laws from the University of Alberta in 1983 and a Doctorate of Juridical Science from the University of Toronto in 1991. She was called to the Alberta Bar in 1989. Justice Martin worked as a researcher and law professor at the University of Calgary from 1982 to 1986. In the 1980s, she also taught in the common law and civil law exchange program organized by the federal Department of Justice, and was a visiting professor at Osgoode Hall Law School. From 1991 to 1996, she was Acting Dean and then Dean of the University of Calgary’s Faculty of Law. Justice Martin taught courses ranging from commercial transactions and feminist legal theory to advanced constitutional law. From 1996 to 2005, Justice Martin practiced criminal and constitutional litigation in Calgary. Her practice was wide-ranging and addressed issues of deep significance to Canadian society. She acted pro bono for the Women’s Legal Education and Action Fund and the Alberta Association of Sexual Assault Centres in cases before the Supreme Court of Canada. In 2000, she drew on her expertise in the area of compensation for the wrongfully convicted as an expert witness in the Thomas Sophonow Inquiry. At the invitation of National Chief of the Assembly of First Nations, Phil Fontaine, she joined the team tasked with finding a new approach to redress the harms caused by the forced attendance of Indigenous children at residential schools. Her work alongside many others contributed to the Indian Residential Schools Settlement Agreement. Justice Martin was appointed to the Court of Queen’s Bench for Alberta in 2005. In 2016, she was appointed to the Courts of Appeal of Alberta, the Northwest Territories, and Nunavut. She has also served as a Deputy Judge for the Supreme Court of Yukon since 2009. Justice Martin’s commitment to teaching and education has carried over into her career on the bench. She serves on the Canadian Judicial Council’s Education Committee and has worked with a variety of organizations on judicial education programming. She was appointed to the  Supreme Court of Canada on December 18, 2017. Webcast of the Ceremony in honour of the Honourable Sheilah L. Martin , held on March 23, 2018."
    },
    {
        "Names of Judges":"The Hon. Nicholas Kasirer",
        "Date of Appointment":"2019-09-16",
        "Date of Departure":null,
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=nicholas-kasirer",
        "bio":"Justice Nicholas  Kasirer graduated from McGill University in 1985 with a Bachelor of Civil Law  and a Bachelor of Laws, following a Bachelor of Arts from the University of  Toronto. In 1986, he completed a postgraduate Diplôme d’études approfondies in  International Law at Université Paris I (Panthéon-Sorbonne) . After clerking for  the Honourable Jean Beetz of the Supreme Court of Canada, he became a member of  the Barreau du Québec in 1987. From 1989 to  2009, Justice Kasirer was a professor at McGill University’s Faculty of Law,  where he taught in several fields, including the law of obligations, property  law, family law, and wills and estates law in both civil and common law. He was  also a visiting professor at various universities, including the Université  Paris I (Panthéon-Sorbonne). He served as Dean of the Faculty of Law at McGill  University from 2003 to 2009. Justice Kasirer  held the James McGill Chair from 2002 to 2009 and directed the Paul-André  Crépeau Centre for Private and Comparative Law from 1996 to 2003. He has  authored over a hundred publications in a variety of fields, including civil  law, comparative law, and jurilinguistics. Since 1990,  Justice Kasirer has been secretary and member of the Editorial Committee of the  Private Law Dictionary \/ Dictionnaire de droit privé at the Faculty of Law at  McGill University. He is a member of the editorial committees of the Revue du  Notariat , the Revue de droit de l’Université de Sherbrooke , the Louisiana State  University Journal of Civil Law Studies, the ISAIDAT Law Review of  Turin (Italy)  and the Revue internationale de droit  comparé in Paris . In 2009, he was  appointed Justice of the Court of Appeal of Quebec. During the last 10 years,  he has rendered many judgments in various fields, such as private law, criminal  law, and public law, including constitutional law. Since 2006, he has been a Titular Member of the  International Academy of Comparative Law (Paris). In 2012, the Université de  Sherbrooke awarded him an honorary doctorate in law. In 2008, he was elected a  Fellow of the Royal Society of Canada. The Honourable Nicholas  Kasirer was appointed to the Supreme Court of Canada on September 16, 2019. Webcast of the Ceremony in honour of the Honourable Nicholas Kasirer , held on November 4, 2019."
    },
    {
        "Names of Judges":"The Hon. Mahmud Jamal",
        "Date of Appointment":"2021-07-01",
        "Date of Departure":null,
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=mahmud-jamal",
        "bio":"Justice  Mahmud Jamal was appointed to the Supreme Court of Canada on July 1, 2021. He  served as a justice of the Court of Appeal for Ontario from 2019 to 2021. Before  his appointment to the bench, Justice Jamal practised with Osler, Hoskin &  Harcourt LLP for over 23 years in the fields of appellate litigation,  constitutional and public law, class actions, and commercial litigation. He  appeared before the Supreme Court of Canada as counsel to a party or intervener  in 35 appeals addressing a wide range of civil, constitutional, criminal, and  regulatory issues, including issues of Quebec civil law. He also appeared  before the courts of seven provinces, the Federal Court, the Federal Court of  Appeal, the Tax Court of Canada, and various federal and provincial  administrative tribunals. As  a lawyer, Justice Jamal was a director of the Canadian Civil Liberties  Association, The Advocates’ Society, and the Osgoode Society for Canadian Legal  History. He was an advocacy advisor to the Supreme Court Advocacy Institute and  a trustee of the Canadian Business Law Journal. He has taught constitutional  law at the Faculty of Law of McGill University and administrative law at  Osgoode Hall Law School, and he has published widely in his areas of practice.  He was also chair of his firm’s national pro bono program and a member of its  partnership board. Justice Jamal is an adjunct  professor at the Faculty of Law of McGill University, a senior fellow of Massey  College at the University of Toronto, and the chair of the Ontario Rhodes  Scholarship Selection Committee. Justice  Jamal was born in Kenya, raised in England, and completed high school in  Edmonton, Alberta. He received a Bachelor of Arts degree from the University of  Toronto, Bachelor of Laws and Bachelor of Civil Law degrees from the Faculty of  Law of McGill University, and a Master of Laws from Yale Law School, which he  attended on a Fulbright Scholarship. He served as a law clerk to Justice Melvin  L. Rothman of the Quebec Court of Appeal and Justice Charles D. Gonthier of the  Supreme Court of Canada. Webcast of the Ceremony in honour of the Honourable Mahmud Jamal , on October 28, 2021, at 2:30 p.m."
    },
    {
        "Names of Judges":"The Hon. Michelle O'Bonsawin",
        "Date of Appointment":"2022-09-01",
        "Date of Departure":null,
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=michelle-obonsawin",
        "bio":"The Honourable Michelle O’Bonsawin  is a widely respected member of Canada’s legal community with a distinguished  career spanning over 20 years. Justice O’Bonsawin was appointed to  the Ontario Superior Court of Justice in Ottawa in 2017. Prior to her  appointment, she was General Counsel for the Royal Ottawa Health Care Group for  eight years. In this role, she developed a thorough understanding of legal  issues related to mental health and performed significant research regarding  the use of Gladue principles  in the forensic mental health system, appearing before various administrative  tribunals and levels of courts, including the Human Rights Tribunal of Ontario,  the Consent and Capacity Board, the Ontario Review Board, the Ontario Superior  Court of Justice, the Ontario Court of Justice, and the Ontario Court of  Appeal. She began her legal career with the legal services at the Royal  Canadian Mounted Police and was then Counsel with Canada Post, specializing in  labour and employment law, human rights, and privacy law. Justice O’Bonsawin has taught  Indigenous law at the University of Ottawa’s Common Law Program and was  previously responsible for the Indigenous Relations Program at the Royal Ottawa  Health Care Group. She is a frequent guest speaker on Gladue principles,  Indigenous issues, as well as mental health, labour, and privacy law. Justice O’Bonsawin is also the  author of various publications such as: Access  to Justice and Gladue Reports: We All Have a Role to Play in Lawyer’s Daily (2020); A Principled Approach: Applying Gladue  Principles at the Ontario Review Board in the National Judicial Institute  Indigenous Law Subject Collection (2018); Canada’s  Bill C-14 [NCR] A Knee Jerk Reaction to Sensationalized Not Criminally  Responsible Cases in the Canadian  Criminal Law Review (2016); Mental  Health Checklist: A Guide for Members of the Judiciary (2016). Justice O’Bonsawin previously served on the  Board of Governors of the University of Ottawa, as well as its Executive  Committee, and as a Board member for the Aboriginal Legal Services of the  University of Ottawa Legal Aid Clinic. She was an  observer member of the Membership Committee of Odanak First Nation and a Board  member of the Canadian Institute for the Administration of Justice.  She  is currently a Partner Judge for Afghanistan Women Judges with the  International Association of Women Judges. Justice O’Bonsawin holds a Bachelor  of Arts from Laurentian University, a Bachelor of Law from the University of  Ottawa, a Master of Law from Osgoode Hall Law School, and a Doctorate in Law  from the University of Ottawa. Born in Hanmer, Ontario, a small  Francophone town near Sudbury, she now resides in Ottawa with her family. A  fluently bilingual Franco-Ontarian, Justice O’Bonsawin is an Abenaki member of  the Odanak First Nation. She was appointed to the Supreme  Court of Canada on September 1, 2022. Webcast of the Ceremony in honour of the Honourable Michelle O'Bonsawin , on November 28, 2022, at 10:30."
    },
    {
        "Names of Judges":"The Hon. Mary T. Moreau",
        "Date of Appointment":"2023-11-06",
        "Date of Departure":null,
        "bio_link":"https:\/\/www.scc-csc.ca\/judges-juges\/bio-eng.aspx?id=mary-t-moreau",
        "bio":"The Honourable  Mary T. Moreau was born in Edmonton, Alberta. Prior to entering law school, she  studied at the Faculté Saint-Jean at the University of Alberta. She completed  her Bachelor of Laws from the University of Alberta in 1979 while taking part  in the common law\/civil law exchange program at the Université de Sherbrooke in  1977. In 2019, she was granted an honourary Doctorate degree from the  University of Alberta and, in November 2023, she received a Lifetime  Achievement Award from Women in Law Leadership. Justice Moreau  was called to the Alberta Bar in 1980. As a lawyer, she practised primarily in  criminal law, constitutional law, and civil litigation. She litigated several  landmark cases involving minority language rights and the Canadian Charter of Rights  and Freedoms. She is a co-founder of the Association des juristes d’expression  française de l’Alberta . She was  appointed as a justice of the Court of King’s Bench of Alberta in 1994. She was  also appointed as a deputy judge of the Supreme Court of Yukon in 1996, and of  the Supreme Court of the Northwest Territories in 2005. In 2017, she was  appointed Chief Justice of the Court of King’s Bench of Alberta. Throughout her  judicial career, Justice Moreau has been actively involved in judicial  education, administration, and ethics. She has  regularly lectured at judicial education conferences and programs, and served  as co-chair of the National Judicial Institute’s annual spring National  Criminal Law Conference for six years. She has also actively participated in  international judicial education and support projects in Mexico, Morocco,  Haiti, Ukraine and Mongolia. She was a member of the National Advisory  Committee on Judicial Ethics from 2014 to 2017. She was president of the  Canadian Superior Courts Judges Association from 2011 to 2012. Up until  recently, she chaired the Judicial Advisory Committee for Military Judge  Appointments and also chaired the Commissioner for Federal Judicial Affairs’  Judicial Advisory Committee on International Engagement. Justice Moreau  was a member of the Canadian Judicial Council from 2017-2023. She served on the  Council’s Executive Committee, its Judicial Conduct Committee, and as chair of  its Technology Subcommittee. She was a member of the Action Committee on  Modernizing Court Operations, co-chaired by the Minister of Justice and Attorney  General of Canada and the Chief Justice of Canada. Justice Moreau  was appointed to the Supreme Court of Canada on November 6, 2023."
    }
]